ЗапросПроводкиДокументовСЗначениямиСубконто.Текст = 
	"
	|ВЫБРАТЬ
	|	Хозрасчетный.Регистратор,
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт,
	|	Субконто.ВидДвижения,
	|	Субконто.Вид КАК Субконто,
	|	Субконто.Значение
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрБухгалтерии.Хозрасчетный.Субконто КАК Субконто
	|ПО
	|	Хозрасчетный.Регистратор = Субконто.Регистратор И
	|	Хозрасчетный.НомерСтроки = Субконто.НомерСтроки
	|УПОРЯДОЧИТЬ ПО
	|	Хозрасчетный.Период,
	|	Хозрасчетный.НомерСтроки
	|ИТОГИ ПО
	|	Хозрасчетный.Регистратор, Хозрасчетный.НомерСтроки
	|";