// Типы данных
// Автор: Гордеев Никита, 2024


// Мягкая  типизация данных встроенного языка позволяет сделать это, не объявляя переменную и ее тип заранее. 

Процедура ПриНачалеРаботыСистемы()
	// Число
	ПеременнаяЧисло = 42;  
	Сообщить("Число: " + ПеременнаяЧисло);
	
	// Строка
	ПеременнаяСтрока = "Пример текста";  
	Сообщить("Строка: " + ПеременнаяСтрока);
	
	МногострочныйТекст = "123
	|345";
	Сообщить("МногострочныйТекст: " + МногострочныйТекст);

	СтрокаПредупреждение = "Внимание! "+"Параметры введены некорректно"; 
	Сообщить("СтрокаПредупреждение: " + СтрокаПредупреждение);

	// Дата
	ПеременнаяДата = ТекущаяДата();  
	Сообщить("Дата: " + Формат(ПеременнаяДата, "ДЛФ=ДАТА"));
	
	ПеременнаяГГГГММДД = '20120314'; //(ГГГГММДД) 
	Сообщить("Дата: " + ПеременнаяГГГГММДД);

	ПеременнаяГГГГММДДЧЧММСС = '20120314172210'; //(ГГГГММДДЧЧММСС) 
	Сообщить("Дата: " + ПеременнаяГГГГММДДЧЧММСС);

	ПеременнаяЛюбыеРазделители = '2012.03.14.17.22.10';
	Сообщить("Дата: " + ПеременнаяЛюбыеРазделители);

	ПеременнаяФункцияДата = Дата(2012, 03, 14);
	Сообщить("Дата: " + ПеременнаяФункцияДата);

	ПеременнаяПустаяДата = Дата(1,1,1); 
	Сообщить("Дата: " + ПеременнаяПустаяДата);

	ПеременнаяКонецДня = КонецДня(ТекДата);
	Сообщить("Дата: " + ПеременнаяКонецДня);

	ПеременнаяКонецМесяца = КонецМесяца(ТекДата);
	Сообщить("Дата: " + ПеременнаяКонецМесяца);

	ПеременнаяКонецГода = КонецГода(ТекДата);
	Сообщить("Дата: " + ПеременнаяКонецГода);

	ПеременнаяНачалоДня = НачалоДня(ТекДата);
	Сообщить("Дата: " + ПеременнаяНачалоДня);

	ПеременнаяНачалоГода = НачалоГода(ТекДата);
	Сообщить("Дата: " + ПеременнаяНачалоГода);

	ПеременнаяНачалоМесяца = НачалоМесяца(ТекДата);
	Сообщить("Дата: " + ПеременнаяНачалоМесяца);

	ПеременнаяСледующаяСекунда = ТекДата + 1; // добавили секунду
	Сообщить("Дата: " + ПеременнаяСледующаяСекунда);

	ПеременнаяСледующийДень = ТекДата + 60*60*24; // добавили сутки
	Сообщить("Дата: " + ПеременнаяСледующийДень);

	ПеременнаяСледующийДень = ДобавитьМесяц(ТекДата,3);
	Сообщить("Дата: " + ПеременнаяСледующийДень);

	// Булево (Истина или Ложь)
	ПеременнаяБулево = Истина;  
	Сообщить("Булево: " + ПеременнаяБулево);
	
	// Неопределено
	ПеременнаяНеопределено = Неопределено;  
	Если ПеременнаяНеопределено = Неопределено Тогда
		Сообщить("Переменная содержит значение 'Неопределено'");
	КонецЕсли;
	
	// NULL
	ПеременнаяNULL = NULL;  
	Если ПеременнаяNULL = NULL Тогда
		Сообщить("Переменная содержит значение 'NULL'");
	КонецЕсли;
	
КонецПроцедуры

