// Булевская логика
// Автор: Гордеев Никита, 2024

Процедура ПриНачалеРаботыСистемы()
	
	// Оператор И
	Результат = Истина И Истина; // Результат = Истина
	Сообщить("Результат: " + Результат);
	
	Результат = Истина И Ложь; // Результат = Ложь
	Сообщить("Результат: " + Результат);
	
	Результат = Ложь И Ложь; // Результат = Ложь
	Сообщить("Результат: " + Результат);
	
	// Оператор ИЛИ
	Результат = Истина ИЛИ Истина; // Результат = Истина
	Сообщить("Результат: " + Результат);
	
	Результат = Истина ИЛИ Ложь; // Результат = Истина
	Сообщить("Результат: " + Результат);
	
	Результат = Ложь ИЛИ Ложь; // Результат = Ложь
	Сообщить("Результат: " + Результат);
	
КонецПроцедуры