// Циклы
// Автор: Гордеев Никита, 2024

Процедура ПриНачалеРаботыСистемы()
	
	// Цикл Для
	Для Сч = 1 По 5 Цикл
		Сообщить(Сч);
	КонецЦикла;
	
	// Цикл Пока
	Сч = 1;
	Пока Сч <= 5 Цикл
		Сообщить(Сч);
		Сч = Сч + 1;
	КонецЦикла;
	
	// Цикл каждого
	Массив = Новый Массив;
	Массив.Добавить("Элемент 1");
	Массив.Добавить("Элемент 2");
	Массив.Добавить("Элемент 3");
	Массив.Добавить("Элемент 4");
	
	Для Каждого ЭлементМассива Из Массив Цикл
		Сообщить(ЭлементМассива); // Пример вывода значений массива
	КонецЦикла;
	
	// Оператор Продолжить
	Для Сч = 1 По 10 Цикл
		Если Сч = 3 Тогда
			Продолжить; // Пропускает оставшуюся часть цикла, когда Сч = 3
		КонецЕсли;
		Сообщить(Сч); // Это будет выполнено только для значений, отличных от 3
	КонецЦикла;
	
	// Оператор Прервать
	Для Сч = 1 По 10 Цикл
		Если Сч = 5 Тогда
			Прервать; // Прерывает цикл, когда Сч = 5
		КонецЕсли;
		Сообщить(Сч); // Выводится до Сч = 4
	КонецЦикла;
	
КонецПроцедуры