// Процедуры и функции
// Автор: Гордеев Никита, 2024

// Процедура выполняет сложение двух чисел и выводит результат
//
// Параметры:
// Число1 - Число - первое число для сложения.
// Число2 - Число - второе число для сложения.
//
// Возвращаемое значение:
// Нет.
//
// Пример:
// Сложить(5, 10); 
Процедура Сложить(Число1, Число2)
    Результат = Число1 + Число2; // Выполняем сложение
    Сообщить("Результат сложения: " + Строка(Результат)); // Выводим результат
КонецПроцедуры


// Функция выполняет сложение двух чисел и возвращает результат
//
// Параметры:
// Число1 - Число - первое число для сложения.
// Число2 - Число - второе число для сложения.
//
// Возвращаемое значение:
// Число - результат сложения двух чисел.
//
// Пример:
// Результат = СложитьИВозвратить(5, 10); // Вернет 15
Функция СложитьИВозвратить(Число1, Число2)
    Результат = Число1 + Число2; // Выполняем сложение
    Возврат Результат; // Возвращаем результат сложения
КонецФункции

	

Процедура ПриНачалеРаботыСистемы()
    Число1 = 5;
    Число2 = 3;
    
    // Процедура
    Сложить(Число1, Число2);

    // Функция 
    РезультатСложения = СложитьИВозвратить(Число1, Число2);
    Сообщить("Результат функции: " + Строка(РезультатСложения));

КонецПроцедуры


// Материалы
// Описание процедур и функций // Информационная система 1С:ИТС URL: https://its.1c.ru/db/v8std/content/453/hdoc