ЗапросВсеЗаписиРегистраНакопленияЗаказыКлиентов.Текст = 
	"
	|ВЫБРАТЬ
	|	ЗаказыКлиентов.Период КАК МоментЗаказа,
	|	ЗаказыКлиентов.НомерСтроки КАК СтрокаВЗаказе,
	|	ЗаказыКлиентов.Клиент КАК КтоЗаказал,
	|	ЗаказыКлиентов.Еда КАК ЧтоЗаказал,
	|	ЗаказыКлиентов.Количество КАК СколькоЗаказал
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
	|УПОРЯДОЧИТЬ ПО
	|	МоментЗаказа ВОЗР,
	|	СтрокаВЗаказе ВОЗР
	|";

ЗапросВсеЗаписиРегистраНакопленияЗапасыЕды.Текст = 
	"
	|ВЫБРАТЬ
	|	ЗапасыЕды.Период,
	|	ЗапасыЕды.Склад,	
	|	ЗапасыЕды.Еда,
	|	ЗапасыЕды.ВидДвижения,
	|	ЗапасыЕды.Количество
	|ИЗ
	|	РегистрНакопления.ЗапасыЕды КАК ЗапасыЕды
	|УПОРЯДОЧИТЬ ПО
	|	ЗапасыЕды.Период
	|";