ЗапросКоличествоЗаказаннойЕдыЗаВсеВремяПоквартально.Текст = 
	"
	|ВЫБРАТЬ
	|	Обороты.Период КАК Период,
	|	Обороты.Еда КАК Еда,
	|	Обороты.КоличествоОборот КАК Количество
	|ИЗ	
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(,, квартал) КАК Обороты
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР,
	|	Количество УБЫВ
	|ИТОГИ ПО
	|	Период
	|
	|";

ЗапросКоличествоЗаказаннойЕдыЗаВсеВремяПоквартальноКратко.Текст = 
	"
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОборотыЗа1Квартал.Еда, ОборотыЗа2Квартал.Еда) КАК Еда,
	|	ОборотыЗа1Квартал.КоличествоОборот КАК ЗаказаноВ1Квартале,
	|	ОборотыЗа2Квартал.КоличествоОборот КАК ЗаказаноВо2Квартале
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(
	|		ДАТАВРЕМЯ(2014, 01, 01), ДАТАВРЕМЯ(2014, 03, 31), ПЕРИОД 
	|	) КАК ОборотыЗа1Квартал
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(
	|		ДАТАВРЕМЯ(2014, 04, 01), ДАТАВРЕМЯ(2014, 06, 30), ПЕРИОД 
	|	) КАК ОборотыЗа2Квартал
	|ПО
	|	ОборотыЗа1КварталЕда = ОборотыЗа2Квартал.Еда
	|УПОРЯДОЧИТЬ ПО
	|	ОборотыЗа1Квартал.Еда.Наименование ВОЗР
	|";

