ЗапросПродажиЕдыВМинус.Текст = 
	"
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЕды.Период КАК ДатаПродажиВМинус,
	|	ОстаткиИОборотыЕды.Склад КАК СоСклада,
	|	ОстаткиИОборотыЕды.Еда,
	|	ОстаткиИОборотыЕды.КоличествоНачальныйОстаток,
	|	ОстаткиИОборотыЕды.КоличествоРасход,
	|	ОстаткиИОборотыЕды.КоличествоКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ЗапасыЕды.ОстаткиИОбороты(,, Запись,,) КАК ОстаткиИОборотыЕды
	|ГДЕ
	|	КоличествоРасход > 0 И 
	|	КоличествоНачальныйОстаток >= 0 И
	|	КоличествоКонечныйОстаток < 0
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиИОборотыЕды.Период,
	|	ОстаткиИОборотыЕды.Еда.Наименование
	|";