// =========================== ВЫБОР ===========================
ЗапросПриветПроизвольнаяСтрока.Текст = 
	"
	|ВЫБРАТЬ
	|	"Привет",
	|	","
	|	"Мир",
	|	"!"
	|";

ЗапросПроизвольныеЧисла.Текст = 
	"
	|ВЫБРАТЬ
	|	1,
	|	2,
	|	3
	|";

ЗапросПроизвольнаяДата.Текст = 
	"
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(2013, 02, 01),
	|	ГОД(ДАТАВРЕМЯ(2013, 02, 01)),
	|	КВАРТАЛ(ДАТАВРЕМЯ(2013, 02, 01)), // число от 1 до 4
	|	МЕСЯЦ(ДАТАВРЕМЯ(2013, 02, 01)), // число от 1 до 12
	|	ДЕНЬГОДА(ДАТАВРЕМЯ(2013, 02, 01)), // число от 1 до 366
	|	ДЕНЬ(ДАТАВРЕМЯ(2013, 02, 01)), // число от 1 до 31
	|	НЕДЕЛЯ(ДАТАВРЕМЯ(2013, 02, 01)), // число, номер недели
	|	ДЕНЬНЕДЕЛИ(ДАТАВРЕМЯ(2013, 02, 01)), // число от 1 до 7
	|	ЧАС(ДАТАВРЕМЯ(2013, 02, 01, 20, 38, 59)), // число от 0 до 23
	|	МИНУТА(ДАТАВРЕМЯ(2013, 02, 01, 20, 38, 59)), // число от 0 до 59
	|	СЕКУНДА(ДАТАВРЕМЯ(2013, 02, 01, 20, 38, 59)), // число от 0 до 59
	|	НАЧАЛОПЕРИОДА(ДАТАВРЕМЯ(2013, 02, 01), ГОД), // МИНУТА, ЧАС, ДЕНЬ, ДЕНЬ, НЕДЕЛЯ, МЕСЯЦ, КВАРТАЛ, ГОД, ДЕКАДА, ПОЛУГОДИЕ
	|	КОНЕЦПЕРИОДА(ДАТАВРЕМЯ(ДАТАВРЕМЯ(2013, 02, 01))),
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2013, 02, 01), МЕСЯЦ, 1), // тип увеличения, величина увеличения
	|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(2013, 02, 01), ДАТАВРЕМЯ(2014, 02, 01), МЕСЯЦ),
	|
	|";

ЗапросПроизвольныеРазныеДанные.Текст = 
	"ВЫБРАТЬ
	|	"Одна секунда до нового тысячелетия!",
	|	ДАТАВРЕМЯ(1999, 12, 31, 23, 59, 59),
	|	1
	|"

ЗапросПодстрока.Текст = 
	"
	|ВЫБРАТЬ
	|	ПОДСТРОКА("1234567890", 3, 4)
	|";
