// =========================== ВЫБОР ИЗ БАЗЫ ДАННЫХ (ВЫБРАТЬ ИЗ) ===========================

// ВЫБРАТЬ 
// 	Что выбираем
// ИЗ
// 	Откуда выбираем

ЗапросСтандартныеРеквизитыСправочников.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Код,
	|	ПометкаУдаления,
	|	Родитель
	|ИЗ 
	|	Справочник.Клиенты
	|";

ЗапросСтандартныеРеквизитыДокумента.Текст = 
	"
	|ВЫБРАТЬ 
	|	Номер,
	|	Дата,
	|	Проведен,
	|	ПометкаУдаления
	|ИЗ
	|	Документ.ЗаказКлиента
	|";

ЗапросНесколькоСвойств.Текст = 
	"
	|ВЫБРАТЬ 
	|	Наименование,
	|	Вкус,
	|	Цвет.Код,
	|	Цвет.Наименование
	|ИЗ
	|	Справочник.Еда
	|";

ЗапросВсехСвойств.Текст =
	"
	|ВЫБРАТЬ *
	|ИЗ Справочник.Еда
	|";

ЗапросПервыхNСтрок.Текст = 
	"
	|ВЫБРАТЬ ПЕРВЫЕ 3
	|	Наименование, Цвет
	|ИЗ
	|	Справочник.Еда
	|";

ЗапросРазличныхСтрок.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Наименование
	|ИЗ
	|	Справочник.Еда";

ЗапросИспользованиеФункцийНадДатой.Текст = 
	"
	|ВЫБРАТЬ
	|	Дата,
	|	Год(Дата),
	|	НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ),
	|	ДАТАВРЕМЯ(1999, 01, 01),
	|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1999,01,01), Дата, ДЕНЬ)
	|ИЗ
	|	Документ.ЗаказКлиента
	|";

ЗапросСложениеСтрок.Текст = 
	"
	|ВЫБРАТЬ
	|""Еда: "" + Наименование
	|ИЗ
	|	Справочник.Еда
	|";

ЗапросПодстрокаНаименование.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	ПОДСТРОКА(Наименование, 1, 2)
	|ИЗ
	|	Справочник.Еда
	|"

ЗапросПсевдонимНаименование.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Наименование КАК Еда
	|ИЗ
	|	Справочник.Еда
	|"

ЗапросСУсловнымОператоромКолонкойЖирность.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Калорийность,
	|	ВЫБОР
	|		КОГДА Калорийность < 100 ТОГДА
	|			""Низкая""
	|		КОГДА Калорийность < 200 ТОГДА
	|			""Нормальная""
	|		ИНАЧЕ
	|			""Высокая""
	|	КОНЕЦ КАК Жирность
	|ИЗ
	|	Справочник.Едач
	|";

ЗапросСЛогическимВыражениемВУсловномОператоре.Текст = 
"
|ВЫБРАТЬ
|	Наименование,
|	ВЫБОР
|	КОГДА Код = ""00000001"" ТОГДА
|		""Банан""
|	КОГДА Код = ""00000002"" ТОГДА
|		Наименование
|	КОГДА Код = ""00000003"" ТОГДА
|		555
|	КОГДА Код = ""00000004"" ТОГДА
|		Калорийность
|	КОГДА Код = ""00000005"" ТОГДА
|		ДАТАВРЕМЯ(2014, 01, 01)
|	КОГДА Код = ""00000006"" ТОГДА
|		ИСТИНА
|	КОГДА Код = ""00000007"" ТОГДА
|		Ссылка
|	КОНЕЦ
|ИЗ
|	Справочник.Еда	
|"

ЗапросНаКакуюБуквуНачинается.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	ВЫБОР
	|		КОГДА Наименование ПОДОБНО ""Б%"" ТОГДА
	|			""Начинается на Б""
	|		КОГДА Наименование ПОДОБНО ""К%"" ТОГДА
	|			""Начинается на К""
	|		ИНАЧЕ
	|			""Начинается на другую букву""
	|	КОНЕЦ
	|ИЗ
	|	Справочник.Еда
	|";

ЗапросДеньНеделиЗаказа.Текст = 
	"
	|ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	ВЫБОР
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 1 ТОГДА
	|			""Понедельник""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 2 ТОГДА
	|			""Вторник""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 3 ТОГДА
	|			""Среда""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 4 ТОГДА
	|			""Четверг""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 5 ТОГДА
	|			""Пятница""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 6 ТОГДА
	|			""Суббота""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 7 ТОГДА
	|			""Воскресенье""
	|";

ЗапросТипЗначения.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Вкус,
	|	ТИПЗНАЧЕНИЯ(Наименование),
	|	ТИПЗНАЧЕНИЯ(Вкус)
	|ИЗ
	|	Справочник.Еда
	|";

ЗапросДругоеЗначениеВместоNULL.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	ЕСТЬNULL(ОтличительныйПризнак, ""Такого реквизита нет!"")
	|ИЗ
	|	Справочник.Города
	|";

ЗапросВыратьТипСредиСоставногоТипа.Текст =
	"
	|ВЫБРАТЬ
	|	Наименование,.
	|	ВЫРАЗИТЬ(ОтличительныйПризнак КАК Справочник.Цвета)
	|ИЗ
	|	Справочник.Города
	|";

ЗапросПеречисленияТолькоМужчины.Текст = 
"
|ВЫБРАТЬ
|	Наименование,
|	Пол
|ИЗ
|	Справочник.Клиенты
|ГДЕ
|	Пол = ЗНАЧЕНИЕ(Перечисление.Пол.Мужской)
|";


ЗапросПредопределенныеЗначенияСправочникаТонна.Текст = 
"
|ВЫБРАТЬ
|	Наименование
|ИЗ
|	Справочник.ЕдиницыИзмерения
|ГДЕ
|	Ссылка = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.Тонна)
|";