// =========================== УСЛОВИЯ (ГДЕ) ===========================

// ВЫБРАТЬ 
// 	Поле1,
// 	Поле2
// ИЗ 
// 	Таблица
// ГДЕ 
// 	<Условие отбора>

// % означает любое количество произвольных символов
// _ означает один произвольный символов
// [] означает любой одиночный символ, перечисленный внутри скобок
// [^] означает любой одиночный символ, кроме тех, что перечислены внутри скобок после ^

// (Перем МЕЖДУ 200 И 300) == (Перем >= 200 И Перем <= 300)
// (Цвет.Наименование В ("Зеленый", "Красный", "Белый")) = (Цвет.Наименование = "Зеленый" ИЛИ Цвет.Наименование = "Красный" ИЛИ Цвет.Наименование = "Белый");

// ВЫБРАТЬ 
// 	ПОЛЕ1,
// 	АГРЕГАТНАЯ_ФУНКЦИЯ(ПОЛЕ2)
// ИЗ
// 	ТАБЛИЦА
// СГРУППИРОВАТЬ ПО
// 	ПОЛЕ1
// ИМЕЮЩИЕ
// 	АГРЕГАТНАЯ_ФУНКЦИЯ(ПОЛЕ2) > 100

ЗапросУсловиеОтбораПростое.Текст = 
	"ВЫБРАТЬ 
	|	Наименование,
	|	Вкус,
	|	Цвет,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Цвет.Наименование = Желтый";

ЗапросУсловиеОтбораСложное.Текст =
	"ВЫБРАТЬ 
	|	Наименование,
	|	Цвет,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ГДЕ 
	|	Цвет.Наименование = ""Белый"" ИЛИ Калорийность > 100";

ЗапросСПростымУсловиемПриГруппировке.Текст = 
	"
	|ВЫБРАТЬ 
	|	Цвет,
	|	СУММА(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет
	|ИМЕЮЩИЕ
	|	СУММА(Калорийнось) > 100";

ЗапросССложнымУсловиемПриГруппировке.Текст = 
	"
	|ВЫБРАТЬ 
	|	Цвет,
	|	СУММА(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет
	|ИМЕЮЩИЕ
	|	СУММА(Калорийнось) > 200 И
	|	СУММА(Калорийнось) < 300 
	|";

ЗапросНаименованиеНаБуквуК.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""[К]%""
	|";

ЗапросНаименованиеИзТрехСимволов.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""___"" 
	|";

ЗапросНаименованиеСБуквыЧИлиЛИОканчивающеесяНаЫИлиН.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""[ЧЛ]%[ЫН]"" 
	|";	

ЗапросНаименованиеНеНачинающеесяНаК.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""[^К]"" 
	|";	

ЗапросНаименованиеНачинающеесяНаБуквуИзДиапазонаОтАДоК.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""[А-К]%"" 
	|";	

ЗапросЧислоВходитВДиапазон.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Калорийность МЕЖДУ 200 И 300
	|";

ЗапросЧислоНеВходитВДиапазон.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Калорийность НЕ МЕЖДУ 200 И 300
	|";

ЗапросЗаказВходитВДиапазонДат.Текст = 
	"
	|ВЫБРАТЬ
	|	Номер,
	|	Дата
	|ИЗ
	|	Документ.ЗаказКлиента
	|ГДЕ
	|	Дата МЕЖДУ ДАТАВРЕМЯ(2014, 01, 01) И ДАТАВРЕМЯ(2014, 01, 31)
	|";

ЗапросСовпадаетЛиЗначениеВыраженияЦвет.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Цвет
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Цвет.Наименование В ("Зеленый", "Красный", "Белый")
	|";

ЗапросВсеНеСовпадающиеЗначенияВыраженияЦвет.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Цвет
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Цвет.Наименование НЕ В ("Зеленый", "Красный", "Белый")
	|";

ЗапросЦветаКоторыеПрисутствуютВОписанииЕды.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|ГДЕ
	|	Наименование В
	|		(
	|			ВЫБРАТЬ
	|				Цвет.Наименование
	|			ИЗ
	|				Справочник.Еда
	|		)
	|";

ЗапросГородаВходящиеВГруппуСтрану.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Города
	|ГДЕ
	|	ССЫЛКА В ИЕРАРХИИ
	|	(
	|		ВЫБРАТЬ 
	|			Ссылка
	|		ИЗ
	|			Справочники.Города
	|		ГДЕ
	|			Наименование = "Россия"
	|	)
	|";

ЗапросВсеСтрочкиИзЗаказовВДиапазонеОт5До15.Текст = 
"
|ВЫБРАТЬ
|	Ссылка.Номер,
|	Ссылка.Количество,
|	Еда,
|	Количество
|ИЗ
|	Документ.ЗаказКлиента.Продукты
|ГДЕ
|	Количество МЕЖДУ 5 И 15"

ЗапросГдеОтличительныйПризнакТипаСтрока.Текст = 
"
|ВЫБРАТЬ
|	Наименование,
|	ОтличительныйПризнак,
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак)
|ИЗ
|	Справочник.Города
|ГДЕ
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак) = ТИП(СТРОКА)
|";

ЗапросГдеОтличительныйПризнакТипаСправочникЦвета.Текст = 
"
|ВЫБРАТЬ
|	Наименование,
|	ОтличительныйПризнак,
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак)
|ИЗ
|	Справочник.Города
|ГДЕ
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак) = ТИП(Справочник.Цвета)
|";

ЗапросДляЭлементовБезОтличительногоПризнака.Текст = 
"
|ВЫБРАТЬ
|	Наименование,
|	ОтличительныйПризнак,
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак)
|ИЗ
|	Справочник.Города
|ГДЕ
|	ОтличительныйПризнак ЕСТЬ NULL
|";

ЗапросДляЭлементовБезОтличительногоПризнака.Текст = 
"
|ВЫБРАТЬ
|	Наименование,
|	ОтличительныйПризнак,
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак)
|ИЗ
|	Справочник.Города
|ГДЕ
|	ОтличительныйПризнак ЕСТЬ НЕ NULL
|";

ЗапросДляЭлементовГдеОтличительныйПризнакНеЗаполнен.Текст = 
"
|ВЫБРАТЬ
|	Наименование,
|	ОтличительныйПризнак,
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак)
|ИЗ
|	Справочник.Города
|ГДЕ
|	ОтличительныйПризнак = НЕОПРЕДЕЛЕНО
|";

ЗапросЯвляетсяЛиЗначениеСсыкойНаТаблицу = 
"
|ВЫБРАТЬ
|	Наименование,
|	ОтличительныйПризнак,
|	ТИПЗНАЧЕНИЯ(ОтличительныйПризнак)
|ИЗ
|	Справочник.Города
|ГДЕ
|	ОтличительныйПризнак ССЫЛКА Справочник.Вкусы
|";

