// =========================== УПОРЯДОЧИВАНИЕ (УПОРЯДОЧИТЬ ПО) ===========================

// ВЫБРАТЬ
// 	ПОЛЕ1,
// 	ПОЛЕ2
// ИЗ
// 	ТАБЛИЦА
// УПОРЯДОЧИТЬ ПО
// 	ПОЛЕ1 ВОЗР,
// 	ПОЛЕ2 УБЫВ

ЗапросУпорядочитьПоУбыванию.Текст =
"
|ВЫБРАТЬ 
|	Код, 
|	Наименование
|ИЗ
|	Справочник.Еда
|УПОРЯДОЧИТЬ ПО
|	Код УБЫВ
|";

ЗапросУпорядочитьПоВозрастанию.Текст = 
"
|ВЫБРАТЬ
|	Код,
|	Наименование
|ИЗ
|	Справочник.Еда
|УПОРЯДОЧИТЬ ПО
|	Наименование ВОЗР
|";

ЗапросУпорядочитьПоВозрастаниюОдинаковыеПоУбыванию.Текст = 
"
|ВЫБРАТЬ
|	Вкус,
|	Цвет
|ИЗ
|	Справочник.Еда
|УПОРЯДОЧИТЬ ПО
|	Вкус.Наименование ВОЗР,
|	Цвет.Наименование УБЫВ
|";

ЗапросАвтоупорядочивание.Текст = 
"
|ВЫБРАТЬ
|	Наименование
|ИЗ
|	Справочник.Клиенты
|УПОРЯДОЧИТЬ ПО
|	ЛюбимыйЦвет
|АВТОУПОРЯДОЧИВАНИЕ"