// =========================== ИТОГИ ПО ===========================

// ВЫБРАТЬ
// 	ПОЛЕ1,
// 	ПОЛЕ2
// ИЗ
// 	ТАБЛИЦА
// ИТОГИ
// 	АГРЕГАТНАЯ_ФУНКЦИЯ(ПОЛЕ2) // СУММА, СРЕДНЕЕ, МИНИМУМ, МАКСИМУМ, КОЛИЧЕСТВО
// ПО
// 	ПОЛЕ1

ЗапросКоличествоПрибывшихГостейДляКаждогоГорода.Текст = 
	"
	|ВЫБРАТЬ
	|	Город,
	|	Номер, 
	|	Количество
	|ИЗ
	|	Документ.ПрибытиеГостей
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Город
	|";

ЗапросИтогиПоВсейТаблице.Текст = 
	"
	|ВЫБРАТЬ
	|	Город,
	|	Номер, 
	|	Количество
	|ИЗ
	|	Документ.ПрибытиеГостей
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ
	|";

ЗапросИтогиПоНесколькимПолям.Текст = 
	"
	|ВЫБРАТЬ
	|	Город,
	|	Номер,
	|	Количество
	|ИЗ
	|	Документ.ПрибытиеГостей
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ,
	|	Город"

ЗапросИтогиДляПапокИЭлементов.Текст = 
	"
	|ВЫБРАТЬ
	|	Город,
	|	Номер, 
	|	Количество
	|ИЗ
	|	Документ.ПрибытиеГостей
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Город ИЕРАРХИЯ
	|";

ЗапросИтогиДляПапок.Текст = 
	"
	|ВЫБРАТЬ
	|	Город,
	|	Номер,
	|	Количество
	|ИЗ
	|	Документ.ПрибытиеГостей
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Город ТОЛЬКО ИЕРАРХИЯ"

ЗапросБезПодведенияИтогов.Текст = 
	"
	|ВЫБРАТЬ
	|	Город,
	|	Номер,
	|	Количество
	|ИЗ
	|	Документ.ПрибытиеГостей
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Город ТОЛЬКО ИЕРАРХИЯ"

ЗапросНаименованиеКалорийностьИтоги.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Калорийность КАК МинимальнаяКалорийность,
	|	Калорийность КАК МаксимальнаяКалорийность,
	|	Калорийность КАК СредняяКалорийность, 
	|	Калорийность КАК КоличествоКалорийность
	|ИЗ
	|	Справочник.Еда
	|ИТОГИ
	|	МИНИМУМ(МинимальнаяКалорийность),
	|	МАКСИМУМ(МаксимальнаяКалорийность),
	|	СРЕДНЕЕ(СредняяКалорийность),
	|	КОЛИЧЕСТВО(КоличествоКалорийность)
	|ПО
	|	ОБЩИЕ
	|";