// =========================== ОБЪЕДИНЕНИЕ ===========================

ЗапросСообщение.Текст = 
	"
	|ВЫБРАТЬ
	|	""Доброе""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Утро,""
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""Планета!""
	|";

ЗапросВсеНазванияЦветовИВкусовВОднойТаблице.Текст = 
	"
	|ВЫБРАТЬ 
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Вкусы
	|";


ЗапросПоляСоставногоТипа.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ 
	|	Справочник.Цвета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|";

ЗапросНесколькоОбъединений.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Код
	|ИЗ
	|	Справочник.Вкусы
	|";

// При объединении запросов полностью одинаковые строки в результате запроса заменяются одной
ЗапросОдинаковыеСтрокиЗаменилисьОдной.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|";

ЗапросОдинаковыеСтрокиОставлены.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|";

// При отдельном упорядочивании результатов запросов будет ошибка 
// Упорядочивать можно только результат
ЗапросУпорядочиваниеРезультатаОбъединения.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Вкусы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование УБЫВ
	|";

// При отдельном подведении итогов будет ошибка
// Подводить итоги можно только по результату объединения
ЗапросИтогиПоРезультатуОбъединения.Текст = 
	"
	|ВЫБРАТЬ
	|	Вкус
	|ИЗ
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Цвет
	|ИЗ
	|	Справочник.Еда
	|
	|ИТОГИ ПО
	|	Вкус
	|";

// У объединяемых запросов должно быть одинаковое количество полей
ЗапросПоступлениеИРасходЕды.Текст = 
	"
	|ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Товар,
	|	СУММА(Количество) КАК Приход,
	|	СУММА(0) КАК Расход
	|ИЗ
	|	Документ.ПоступлениеЕды.Еда
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	СУММА(0),
	|	СУММА(Количество)
	|ИЗ
	|	Документ.ПродажаЕды.Еда
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование
	|";