// =========================== ПАРАМЕТРЫ ===========================

ЗапросЕдаЗаданныйПараметрЦветТипаСтрока.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Цвет
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Цвет.Наименование = ""Жёлтый""
	|";


ЗапросЕдаПараметрЦветТипаСтрока.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Цвет
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Цвет.Наименование = &ВыбранныйЦвет
	|";

ЗапросПараметрЦветТипаСсылка.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Цвет
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Цвет = &ВыбранныйЦвет
	|";

ЗапросПараметрТипаДата.Текст = 
	"
	|ВЫБРАТЬ
	|	Номер,
	|	Дата
	|ИЗ
	|	Документ.ЗаказКлиента
	|ГДЕ
	|	Дата МЕЖДУ &НачалоИнтервала И &КонецИнтервала
	|";

ЗапросПродажаЕдыЗаВыбранныйМесяц.Текст = 
	"
	|ВЫБРАТЬ
	|	Номер,
	|	Дата
	|ИЗ
	|	Документ.ПродажаЕды
	|ГДЕ
	|	МЕСЯЦ(Дата) = &НомерМесяца
	|";

ЗапросНаименованиеНачинающеесяНаЧастьСтроки.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""%"" + &ЧастьСтроки + ""%""
	|";

