ЗапросПакетныйЗапрос.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование КАК Цвет
	|ИЗ
	|	Справочник.Цвета
	|;
	|ВЫБРАТЬ
	|	Наименование КАК Вкус
	|ИЗ 
	|	Справочник.Вкусы
	|";	

ЗапросВременнаяТаблица.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование КАК Цвет
	|ПОМЕСТИТЬ 
	|	ТАБЛИЦА_ЦВЕТОВ
	|ИЗ
	|	Справочник.Цвета
	|
	|;
	|
	|ВЫБРАТЬ
	|	Наименование КАК Вкус
	|ПОМЕСТИТЬ
	|	ТАБЛИЦА_ВКУСОВ
	|ИЗ
	|	Справочник.Вкусы
	|
	|;
	|
	|ВЫБРАТЬ
	|	Цвет КАК Поле
	|ИЗ
	|	ТАБЛИЦА_ЦВЕТОВ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Вкус
	|ИЗ 
	|	ТАБЛИЦА_ВКУСОВ
	|";

ЗапросКоличествоПоступившейИПроданнойЕды.Текст =
	" 
	|ВЫБРАТЬ
	|	Ссылка.Склад.Наименование КАК Склад,
	|	СУММА(Количество) КАК Приход,
	|	СУММА(0) КАК Расход      
	|ПОМЕСТИТЬ
	|	ПРИХОД_РАСХОД
	|ИЗ
	|	Документ.ПоступлениеЕды.Еда
	|СГРУППИРОВАТЬ ПО
	|	Ссылка.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ 
	|
	|ВЫБРАТЬ 
	|	Ссылка.Склад.Наименование,
	|	СУММА(0),
	|	СУММА(Количество) 
	|ИЗ
	|	Документ.ПродажаЕды.Еда
	|СГРУППИРОВАТЬ ПО
	|	Ссылка.Склад
	|;
	|
	|ВЫБРАТЬ
	|	Склад,
	|	СУММА(Приход),
	|	СУММА(Расход)
	|ИЗ
	|	ПРИХОД_РАСХОД
	|СГРУППИРОВАТЬ ПО
	|	Склад
	|УПОРЯДОЧИТЬ ПО
	|	Склад
	|";
	
