// Циклы
// Автор: Гордеев Никита, 2024

Процедура ПриНачалеРаботыСистемы()
	
	// =========================== Для Цикл ===========================
	Для Сч = 1 По 5 Цикл
		Сообщить(Сч); // 1 2 3 4 5
	КонецЦикла;

	// =========================== Для Каждого Цикл ===========================
	
	Массив = Новый Массив;
	Массив.Добавить("Элемент 1");
	Массив.Добавить("Элемент 2");
	Массив.Добавить("Элемент 3");
	Массив.Добавить("Элемент 4");
	
	Для Каждого ЭлементМассива Из Массив Цикл
		Сообщить(ЭлементМассива); // Пример вывода значений массива
	КонецЦикла;

	// =========================== Пока Цикл ===========================
	Сч = 1;
	Пока Сч <= 5 Цикл
		Сообщить(Сч);
		Сч = Сч + 1;
	КонецЦикла;

	Дни = Новый Массив();
    Дни.Добавить("Понедельник");
    Дни.Добавить("Вторник");
    Дни.Добавить("Среда");

	Сч = 0;
	Пока Счетчик < Дни.Количество() Цикл        
		Сообщить(Дни[Сч]); // Понедельник Вторник Среда
		Сч = Сч + 1;     
	КонецЦикла; 
	
	// обратный цикл
	Сч = Дни.Количество() - 1;     
    Пока Сч >= 0 Цикл
        Сообщить(Дни[Сч]); // Среда Вторник Понедельник
        Счетчик = Сч - 1;
    КонецЦикла;


	// =========================== Оператор Продолжить ===========================
	Для Сч = 1 По 5 Цикл
		Если Сч = 3 Тогда
			Продолжить; // Пропускает оставшуюся часть цикла, когда Сч = 3
		КонецЕсли;
		Сообщить(Сч); // 1, 2, 4, 5
	КонецЦикла;
	
	// =========================== Оператор Прервать ===========================
	Для Сч = 1 По 10 Цикл
		Если Сч = 5 Тогда
			Прервать; // Прерывает цикл, когда Сч = 5
		КонецЕсли;
		Сообщить(Сч); // 1, 2, 3, 4
	КонецЦикла;
	
КонецПроцедуры