// В Python это обычный список (list)

Процедура ПриНачалеРаботыСистемы()

	// =========================== создать список значений ===========================
	Список = Новый СписокЗначений;

	// добавить элемент в список значений
	Список.Добавить(
        1980, // значение элемента
        "Год рождения Васи" // представление        
    );
	Список.Добавить(1985, "Год рождения Юли");
	Список.Добавить("Полина", "Имя ребёнка");

	// вставить элемент в список значений
	Список.Вставить(2, 2010, "Год рождения их совместной дочки");

	// =========================== операции над списком значений ===========================

	// обход элементов списков значений
	Для Каждого Элемент Из Список Цикл
        Сообщить(
            Элемент.Представление + ": " +
            Строка(Элемент.Значение)
        );
    КонецЦикла;

	// обход элементов списков по его индексу
    Для Индекс = 0 По Список.Количество() - 1 Цикл
        Сообщить(Список[Индекс]);
    КонецЦикла;

	// очистить список значений
	Список.Очистить()

	Список.Добавить("Понедельник");
    Список.Добавить("Вторник");
    Список.Добавить("Среда");

	// найти элемент списка по его значению
	ЗначВторник = Список.НайтиПоЗначению("Вторник");

	// узнать индекс элемента в списке 
	Сообщить(Список.Индекс(ЗначВторник)); // 1

	// отсортировать список по его значениям
	Список.СортироватьПоЗначению(НаправлениеСортировки.Убыв); // стало: среда, понедельник, вторник

	// удалить элемент из списка значений
	Список.Удалить(Список[0]);

	// сдвинуть элемент списка значений
	Список.Сдвинуть(0, 1); // стало: вторник понедельник 

	// сделать копию
	КопияСписка = Список.Скопировать();


КонецПроцедуры