// В Python это библиотека pandas для работы с табличными данными

&НаСервере
Процедура ВыполнитьКодНаСервере()

	// =========================== создать таблицу значений ===========================
	Таб = Новый ТаблицаЗначений;
	
	// добавить колонки
	Таб.Колонки.Добавить("Фрукт");
    Таб.Колонки.Добавить("Цвет");
    Таб.Колонки.Добавить("Вкус");
	
	// добавить строки 
	Стр = Таб.Добавить();
    Стр.Фрукт = "Яблоко";
    Стр.Цвет = "Зелёный";
    Стр.Вкус = "Кислый";
 
    Стр = Таб.Добавить();
    Стр.Фрукт = "Банан";
    Стр.Цвет = "Желтый";
    Стр.Вкус = "Сладкий";
 
    Стр = Таб.Добавить();
    Стр.Фрукт = "Слива";
    Стр.Цвет = "Синий";
    Стр.Вкус = "Терпкий"; 

	// добавить в таблицу значений колонку
	ОписаниеВеса = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3));

	Таб.Колонки.Добавить("ВесФрукта", ОписаниеВеса, "Вес фрукта");
    Таб[0].ВесФрукта = 100.005;
    Таб[1].ВесФрукта = 60.010;
    Таб[2].ВесФрукта = 25.000;

	// =========================== операции над таблицей значений ===========================

	// перечислить все строки в таблице значений
	Для Каждого Стр Из Таб Цикл
        Сообщить(Стр.Фрукт + " " + Стр.Цвет + " " + Стр.Вкус +
            " " + Стр.ВесФрукта);
    КонецЦикла;

	// перечислить все колонки в таблице значений
	Для Каждого Колонка Из Таб.Колонки Цикл
        Сообщить(Колонка.Имя);
    КонецЦикла; 

	// выгрузить колонку таблицы значений в массив
	МассивФруктов = Таб.ВыгрузитьКолонку("Фрукт"); // выгрузка названий фруктов в массив
	
	// загрузить массив в колонку таблицы значений 
	Таб.ЗагрузитьКолонку(МассивФруктов, "Фрукт");

	// заполнить значения в колонке для всех строк таблицы
	Таб.ЗаполнитьЗначения(0, "ВесФрукта");
    Таб[0].ВесФрукта = 100;
    Таб[1].ВесФрукта = 60;
    Таб[2].ВесФрукта = 25;

	// посчитать итог по колонке
	Сообщить(Таб.Итог("ВесФрукта")); // 185

	// найти строку в таблице значений по значению
	НайденнаяСтрока = Таб.Найти( "Яблоко" );
    Если НайденнаяСтрока <> Неопределено Тогда
        Сообщить(НайденнаяСтрока.Цвет); // Зелёный
    КонецЕсли;

	// найти строку в таблице значений поиском значения в определенных колонках
	НайденнаяСтрока = Таб.Найти("Кислый", "Вкус, Цвет");
    Если НайденнаяСтрока <> Неопределено Тогда
        Сообщить(НайденнаяСтрока.Фрукт); // Яблоко
    КонецЕсли;

	// полная копия
    КопияТаб = Таб.Скопировать();

	// копию таблицы значений по нужным колонкам
	КопияТаб = Таб.СкопироватьКолонки("Фрукт, Цвет");


КонецПроцедуры

	
Процедура ПриНачалеРаботыСистемы()

	// с таблицей значений можно работать только на сервере
	ВыполнитьКодНаСервере();

КонецПроцедуры