// Механизмы оповещения пользователя
// Автор: Гордеев Никита, 2024

Процедура ПриНачалеРаботыСистемы()
	
	// =========================== Сообщить ===========================
	Сообщить("Процесс завершен успешно!"); // Сообщение без типа
	
	Число1 = 5;
	Число2 = 10;
	Сообщить("Результат сложения: " + Строка(Число1 + Число2));
	
	// =========================== СообщениеПользователю ===========================
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Контрагент должен быть указан";
	Сообщение.Поле = "ПолеНаФорме";
	Сообщение.Сообщить();
	
	// =========================== Оповещение ===========================
	ПоказатьОповещениеПользователя("Вы нажали на кнопку!", ,
		"Теперь должно что-то произойти!", ,
		СтатусОповещенияПользователя.Важное);
	
	ПоказатьОповещениеПользователя("Вы нажали на кнопку!", ,
		"Теперь должно что-то произойти!", ,
		СтатусОповещенияПользователя.Важное,
		"ПервоеОповещение");
	
	ПоказатьОповещениеПользователя("Вы нажали на кнопку!", ,
		"Теперь должно что-то произойти!",
		БиблиотекаКартинок.Оповещения,
		СтатусОповещенияПользователя.Важное,
		"ПервоеОповещение");
	
	
КонецПроцедуры