Функция ПузырьковаяСортировка(Массив)
	
	Пока Истина Цикл
		БылиПерестановки = Ложь;
		Для Индекс = 1 По Массив.Количество() - 1 Цикл  
			Если Массив[Индекс - 1] > Массив[Индекс] Тогда  
				ВременноеЗначение = Массив[Индекс - 1];
				Массив[Индекс - 1] = Массив[Индекс];
				Массив[Индекс] = ВременноеЗначение; 
				БылиПерестановки = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ БылиПерестановки Тогда
			Прервать;    
		КонецЕсли;  
	КонецЦикла;     
	
	Возврат Массив;
КонецФункции


Процедура СообщитьМассив(Массив)
	СтрокаВывода = "";
	
	Для Индекс = 0 По Массив.Количество()-1 Цикл
		СтрокаВывода = СтрокаВывода + Массив[Индекс] + " ";
	КонецЦикла;                       
	
	Сообщить (СтрокаВывода);	
КонецПроцедуры

Функция ПеремешатьМассив(Массив)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		ПоменятьСЭлементов = ГСЧ.СлучайноеЧисло(0, 9);
		Буфер = Массив[Индекс];
		Массив[Индекс] = Массив[ПоменятьСЭлементов];
		Массив[ПоменятьСЭлементов] = Буфер;
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция СоздатьМассивНа10Элементов()
	Массив = Новый Массив(10);
	Для Индекс = 0 По 9 Цикл
		Массив[Индекс] = Индекс + 1;
	КонецЦикла;
	Возврат Массив;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	Массив = СоздатьМассивНа10Элементов();
	СообщитьМассив(Массив);
	Массив = ПеремешатьМассив(Массив);
	СообщитьМассив(Массив);
	Массив = ПузырьковаяСортировка(Массив);
	СообщитьМассив(Массив);
КонецПроцедуры
