Функция ПеремноженныйМассив(Числа)
	Копия = Новый Массив;
	Для Индекс = 0 По Числа.Количество() - 1 Цикл
		Копия.Добавить(Числа[Индекс]);
	КонецЦикла;

	Для Индекс = 0 По Копия.Количество() - 1 Цикл
		Копия[Индекс] = Копия[Индекс] * (Индекс + 1);
	КонецЦикла;

	Возврат Копия;
КонецФункции

Процедура СообщитьМассив(Числа)
	СтрокаВывода = "";
	
	Для Индекс = 0 По Числа.Количество()-1 Цикл
		СтрокаВывода = СтрокаВывода + Числа[Индекс] + " ";
	КонецЦикла;                       
	
	Сообщить (СтрокаВывода);	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	Числа = Новый Массив(10);
	Для Индекс = 0 По 9 Цикл
		Числа[Индекс] = Индекс + 1;
	КонецЦикла;

	ПеремноженныеЧисла = ПеремноженныйМассив(Числа);
	СообщитьМассив(ПеремноженныеЧисла);

	СообщитьМассив(Числа)
КонецПроцедуры