Функция ТекущийДеньНеделиСтрокой(ДатаОтПользователя)

	// без формата
	СегодняшнийДень = ДеньНедели(ДатаОтПользователя);
	
	Если СегодняшнийДень = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли СегодняшнийДень = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли СегодняшнийДень = 3 Тогда
		Возврат "Среда";
	ИначеЕсли СегодняшнийДень = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли СегодняшнийДень = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли СегодняшнийДень = 6 Тогда
		Возврат "Суббота";
	ИначеЕсли СегодняшнийДень = 7 Тогда
		Возврат "Воскресенье";
	КонецЕсли;

	// с форматом
	Возврат(День(Дата(ДатаОтПользователя)));
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	Сообщить(ТекущийДеньНеделиСтрокой(ТекущаяДата()));
КонецПроцедуры