Процедура ПриНачалеРаботыСистемы()
	ВыборПользователя = Вопрос("Нажимите Да, чтобы вывести числа от 1 до 10, " + 
	"Нет - чтобы вывести числа от 10 до 100, " + 
	"Отмена - чтобы закрыть окно", 
	РежимДиалогаВопрос.ДаНетОтмена);
	
	Если ВыборПользователя = КодВозвратаДиалога.Да Тогда
		СтрокаОтвета = "";
		Для Числа = 1 По 10 Цикл
			СтрокаОтвета = СтрокаОтвета + Числа + " ";
		КонецЦикла;
		Сообщить(СтрокаОтвета);
	ИначеЕсли ВыборПользователя = КодВозвратаДиалога.Нет Тогда
		СтрокаОтвета = "";
		Для Числа = 10 По 100 Цикл
			СтрокаОтвета = СтрокаОтвета + Числа + " ";
		КонецЦикла;
		Сообщить(СтрокаОтвета);
	ИначеЕсли ВыборПользователя = КодВозвратаДиалога.Отмена Тогда
		ОткрытьЗначение("Вы отменили ввод");
	КонецЕсли;
	
КонецПроцедуры
