// Произведение всех цифр числа

Функция ПроизведениеВсехЧиселЧисла(Число)
    // Переменные для хранения остатка и произведения цифр
    Остаток = 0;
    Произведение = 1;

    // Цикл для вычисления произведения цифр числа
    Пока Число > 0 Цикл
        Остаток = Число % 10; // Находим последнюю цифру
        Произведение = Произведение * Остаток; // Умножаем на нее
        Число = Цел(Число / 10); // Убираем последнюю цифру
    КонецЦикла;

	Возврат Произведение;	
КонецФункции

Процедура ПриНачалеРаботыСистемы()
    // Ввод числа от пользователя
    Число1 = 269;         
	Сообщить("Результат = " + ПроизведениеВсехЧиселЧисла(Число1)); // 108
	
    Число2 = 12345;         
	Сообщить("Результат = " + ПроизведениеВсехЧиселЧисла(Число2)); // 120
КонецПроцедуры

