ЗапросВсеНазванияЦветов.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ 
	|	Справочник.Цвета
	|";

ЗапросПервыеТриЦвета.Текст = 
	"
	|ВЫБРАТЬ ПЕРВЫЕ 3
	|	Наименование
	|ИЗ 
	|	Справочник.Цвета
	|";

ЗапросВсеЦветаВАлфавитномПорядке.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Цвета
	|УПОРЯДОЧИТЬ ПО
	|	Наименование ВОЗР
	|";


ЗапросЧерныйЦвет.Текст = 
	"ВЫБРАТЬ
	|	Наименование
	|ИЗ 
	|	Справочник.Цвета
	|ГДЕ
	|	Наименование = ""Черный""
	|";

ЗапросРазличныеИмена.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Наименование
	|ИЗ
	|	Справочник.Клиенты
	|";

ЗапросЛюбимыеЦвета.Текст = 
	"ВЫБРАТЬ
	|	Наименование,
	|	ЛюбимыйЦвет
	|ИЗ
	|	Справочник.Клиенты
	|";

ЗапросКлиентыИИхЦвета.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	ЛюбимыйЦвет
	|ИЗ
	|	Справочник.Клиенты
	|ГДЕ
	|	Наименование = ""Андрей"" ИЛИ ЛюбимыйЦвет.Наименование = ""Зелёный""
	|";

