ЗапросКалорийностьОт200До300.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	КАЛОРИЙНОСТЬ МЕЖДУ 200 и 300
	|";

ЗапросКалорийностьПоУбыванию.Текст = 
	"
	|ВЫБРАТЬ
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|УПОРЯДОЧИТЬ ПО
	|	КАЛОРИЙНОСТЬ УБЫВ
	|";

ЗапросКалорийностьПоУбыванию.Текст = 
	"
	|ВЫБРАТЬ ПЕРВЫЕ 3
	|	Наименование,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|УПОРЯДОЧИТЬ ПО
	|	КАЛОРИЙНОСТЬ УБЫВ
	|";

ЗапросМаксимальнаяКалорийностьПоЦветам.Текст = 
	"
	|ВЫБРАТЬ
	|	Цвет,
	|	Максимум(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет
	|";

ЗапросКоличествоПродуктовКаждогоВкуса.Текст = 
	"
	|ВЫБРАТЬ
	|	Вкус,
	|	КОЛИЧЕСТВО(Вкус) КАК Количество
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Вкус
	|";

ЗапросМинимальнаяКалорийностьКаждогоВкуса.Текст = 
	"
	|ВЫБРАТЬ
	|	Вкус,
	|	МИНИМУМ(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО 
	|	Вкус
	|";

ЗапросКоличествоРазличногоВкуса.Текст = 
	"
	|ВЫБРАТЬ
	|	Вкус,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Цвет)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО 
	|	Вкус
	|";

ЗапросСуммарнаяКалорийность.Текст = 
	"
	|ВЫБРАТЬ
	|	Вкус,
	|	СУММА(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Вкус
	|";


ЗапросПродуктыИКалорийность.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Цвет,
	|	Вкус,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ИТОГИ
	|	СУММА(Калорийность)
	|ПО 
	|	ОБЩИЕ
	|";

ЗапросПродуктыИКалорийностьДляКаждого.Текст
	"ВЫБРАТЬ
	|	Наименование,
	|	Цвет,
	|	Вкус,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ИТОГИ 
	|	Сумма(Калорийность)
	|ПО
	|	ОБЩИЕ,
	|	Цвет
	|";


ЗапросПродуктыИСреднееЗначениеДляКаждого.Текст
	"ВЫБРАТЬ
	|	Наименование,
	|	Вкус,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ИТОГИ 
	|	СРЕДНЕЕ(Калорийность)
	|ПО
	|	ОБЩИЕ,
	|	Вкус
	|";


ЗапросРасчетПитательности.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование,
	|	Калорийность,
	|	ВЫБОР
	|	КОГДА Калорийность < 100 ТОГДА
	|		""Легкая""
	|	КОГДА Калорийность < 300 ТОГДА
	|		""Средняя""
	|	ИНАЧЕ
	|		""Высокая""
	|	КОНЕЦ КАК Питательность
	|ИЗ
	|	Справочник.Еда
	|";

ЗапросГрупировкаПоПитательности.Текст = 
	"
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Калорийность < 100 ТОГДА
	|			""Легкая""
	|		КОГДА Калорийность < 300 ТОГДА
	|			""Средняя""
	|		ИНАЧЕ
	|			""Высокая""
|		КОНЕЦ КАК Питательность
	|	Наименование,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ИТОГИ ПО
	|	Питательность
	|";

ЗапросУпорядочитьПоПитательностиИКалорийности.Текст = 
	"
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Калорийность < 100 ТОГДА
	|			""Легкая""
	|		КОГДА Калорийность < 300 ТОГДА
	|			""Средняя""
	|		ИНАЧЕ
	|			""Высокая""
|		КОНЕЦ КАК Питательность
	|	Наименование,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ИТОГИ ПО
	|	Питательность
	|УПОРЯДОЧИТЬ ПО
	|	Питательность ВОЗР,
	|	Калорийность ВОЗР
	|";


ЗапросЕдаСБуквыК.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""К%""
	|";

ЗапросЕдаОканчивающаясяНаБуквуК.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""%к""
	|";

ЗапросЕдаСодержащаяБуквуКНеВНачалеИНеВКонце.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""%_к_%""
	|";

ЗапросЕдаДлиннойБолееПятиБукв.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование ПОДОБНО ""_____%""
	|";

ЗапросЕдаКотораяНачинаетсяНеСБуквыК.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Наименование НЕ ПОДОБНО ""К%""
	|";

ЗапросКлиентыИЛюбимаяЕда.Текст = 
	"
	|ВЫБРАТЬ
	|	Клиенты.Наименование КАК Клиент,
	|	Еда.Наименование КАК ЛюбимаяЕда
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Еда КАК Еда
	|ГДЕ
	|	Клиенты.ЛюбиыйЦвет = Еда.Цвет
	|";

ЗапросЦветаНеЛюбимыеУКлиентов.Текст = 
	"
	|ВЫБРАТЬ
	|	Цвета.Наименование КАК Цвет
	|ИЗ
	|	Справочник.Цвета КАК Цвета
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Клиенты КАК Клиенты
	|ПО
	|	Цвета.Наименование = Клиенты.ЛюбимыйЦвет.Наименование
	|ГДЕ
	|	Клиенты.ЛюбиыйЦвет ЕСТЬ NULL
	|";	

ЗапросЕдаНеЛюбимаяУКлиентов.Текст = 
	"
	|ВЫБРАТЬ
	|	Еда.Наименование
	|ИЗ
	|	Справочник.Еда КАК Еда	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Клиенты КАК Клиенты
	|ПО
	|	Еда.Цвет = Клиенты.ЛюбимыйЦвет   
	|ГДЕ
	|	Клиенты.ЛюбимыйЦвет ЕСТЬ NULL
	|";	

ЗапросЦветаКоторыхНетСредиЕды.Текст = 
	"
	|ВЫБРАТЬ РАЗЛИЧНЫЕ             
	|	Цвета.Наименование КАК Цвет
	|ИЗ
	|	Справочник.Цвета КАК Цвета
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Еда КАК Еда
	|ПО
	|	Еда.Цвет = Цвета.Ссылка
	|ГДЕ
	|	Еда.Цвет ЕСТЬ NULL
	|";

ЗапросАндрейИЕгоЛюбимыеПродукты.Текст = 
	"
	|ВЫБРАТЬ
	|	""Андрей""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ	
	|	Еда.Наименование
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Еда КАК Еда
	|ПО
	|	Клиенты.ЛюбимыйЦвет = Еда.Цвет
	|ГДЕ 
	|	Клиенты.Наименование = ""Андрей""
	|";

ЗапросПродуктыИмеющиеНечетнуюКалорийность.Текст = 
	"
	|ВЫБРАТЬ
	|	Еда.Наименование,
	|	Еда.Калорийность
	|ИЗ 
	|	Справочник.Еда КАК Еда
	|ГДЕ
	|ВЫРАЗИТЬ (Калорийность / 2 КАК Число(3, 0)) <> (Калорийность / 2)
	|";

ЗапросПродуктыОтсортированныеПоДлинеНаименование.Текст = 
	"
	|ВЫБРАТЬ
	|	Еда.Наименование
	|ИЗ
	|	Справочник.Еда КАК Еда
	|УПОРЯДОЧИТЬ ПО 
	|	ДЛИНАСТРОКИ(Еда.Наименование) ВОЗР
	|";

ЗапросРеквизитыСправочникаЕда.Текст = 
	"
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Код"" КАК Реквизит,
	|	ТИПЗНАЧЕНИЯ(Код) КАК Тип
	|ИЗ
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Наименование"",
	|	ТИПЗНАЧЕНИЯ(Наименование)
	|ИЗ 
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Вкус"",
	|	ТИПЗНАЧЕНИЯ(Вкус)
	|ИЗ 
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Цвет"",
	|	ТИПЗНАЧЕНИЯ(Цвет)
	|ИЗ 
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Калорийность"",
	|	ТИПЗНАЧЕНИЯ(Калорийность)
	|ИЗ 
	|	Справочник.Еда
	|";

ЗапросУпорядочиваниеПоДате.Текст = 
	"
	|ВЫБРАТЬ
	|	Клиент,
	|	Номер
	|	Дата
	|ИЗ
	|	Документ.ЗаказКлиента
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	Клиент
	|";

ЗапросКоличествоЗаказов.Текст =
	"
	|ВЫБРАТЬ
	|	Клиент,
	|	НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) КАК Период,
	|	КОЛИЧЕСТВО(Ссылка) КАК КоличествоЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ),
	|	Клиент
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Клиент
	|ИТОГИ 
	|	СУММА(КоличествоЗаказов)
	|ПО
	|	Период
	|";

ЗапросКлиентСКоличествомЗаказовБольшеДвух.Текст = 
	"
	|ВЫБРАТЬ
	|	Клиент,
	|Количество(Ссылка) КАК КоличествоЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента
	|СГРУППИРОВАТЬ ПО
	|	Клиент
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Ссылка) > 2
	|";

ЗапросГруппировкаЗаказовПоДнямНедели.Текст = 
	"
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 1 ТОГДА
	|			""Понедельник""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 2 ТОГДА
	|			""Вторник""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 3 ТОГДА
	|			""СРЕДА""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 4 ТОГДА
	|			""Четверг""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 5 ТОГДА
	|			""Пятница"" 
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 6 ТОГДА
	|			""Суббота""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 7 ТОГДА
	|			""Воскресенье""
	|	КОНЕЦ КАК День,
	|	Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказКлиента
	|УПОРЯДОЧИТЬ ПО
	|	ДЕНЬНЕДЕЛИ(Дата)
	|ИТОГИ ПО
	|	День
	|";

ЗапросКоличествоЗаказанныхПродуктовПоМесяцамПоУбыванию.Текст = 
	"
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Ссылка.Дата, МЕСЯЦ) КАК Период,
	|	Еда,
	|	Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Продукты
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР,
	|	Количество УБЫВ
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Период
	|";

