ЗапросДляПарКлиентЕдаПерваяЦенаИДатаПоследняяЦенаИДата = 
    "
    |ВЫБРАТЬ
    |   ЦеныСрезПервых.Клиент,
    |   ЦеныСрезПервых.Еда,
    |   ЦеныСрезПервых.Цена КАК ПерваяЦена,
    |   ЦеныСрезПервых.Период КАК ПоследняяЦена,
    |   ЦеныСрезПоследних.Цена КАК ПоследняяЦена,
    |   ЦеныСрезПоследних.Период КАК ДатаУстановкиПоследнейЦены
    |ИЗ
    |   РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПервых() КАК ЦеныСрезПервых
    |ВНУТРЕННЕЕ СОЕДИНЕНЕИЕ
    |   РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПоследних() КАК ЦеныСрезПоследних
    |ПО
    |   ЦеныСрезПервых.Клиент = ЦеныСрезПоследних.Клиент И 
    |   ЦеныСрезПервых.Еда = ЦеныСрезПоследних.Еда
    |УПОРЯДОЧИТЬ ПО
    |   ЦеныСрезПервых.Клиент.Наименование ВОЗР,
    |   ЦеныСрезПервых.Еда.Наименование ВОЗР
    |
    |ИТОГИ ПО
    |   ЦеныСрезПервых.Клиент
    |";