
ЗапросВсеДвиженияПоРегиструЦенаНаЕдуДляКлиентов.Текст = 
	"
	|ВЫБРАТЬ
	|	Цены.Период,
	|	Цены.Активность,
	|	Цены.Еда,
	|	Цены.Клиент,
	|	Цены.Цена
	|ИЗ 
	|	РегистрСведений.ЦенаНаЕдуДляКлиентов КАК Цены
	|УПОРЯДОЧИТЬ ПО
	|	Цены.Период
	|";

ЗапросАктуальныеЦеныНаЕдуДляКаждогоКлиента.Текст = 
	"
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Клиент.Наименование КАК Клиент,
	|	ЦеныСрезПоследних.Еда.Наименование КАК Еда,
	|	ЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПоследних() КАК ЦеныСрезПоследних
	|УПОРЯДОЧИТЬ ПО
	|	Клиент ВОЗР,
	|	ЕДА ВОЗР
	|ИТОГИ ПО
	|	ЦеныСрезПоследних.Клиент
	|";

ЗапросЦеныНаБананыНаКонецЯнваря.Текст = 
	"
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Клиент.Наименование КАК Клиент,
	|	ЦеныСрезПоследних.Еда.Наименование КАК Еда,
	|	ЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПоследних(ДАТАВРЕМЯ(2014, 01, 31), Еда.Наименование = ""Банан"") КАК ЦеныСрезПоследних
	|УПОРЯДОЧИТЬ ПО
	|	Клиент ВОЗР,
	|	Еда ВОЗР
	|ИТОГИ ПО
	|	ЦеныСрезПоследних.Клиент
	|";

ЗапросЦеныПослеЯнваряНаКлубнику.Текст = 
	"
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Клиент.Наименование КАК Клиент,
	|	ЦеныСрезПоследних.Еда.Наименование КАК Еда,
	|	ЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПоследних(ДАТАВРЕМЯ(2014, 02, 01), Еда.Наименование = ""Клубника"") КАК ЦеныСрезПоследних
	|УПОРЯДОЧИТЬ ПО
	|	Клиент ВОЗР,
	|	Еда ВОЗР
	|ИТОГИ ПО
	|	ЦеныСрезПоследних.Клиент
	|";

ЗапросЦеныПослеЯнваряНаКлубнику.Текст = 
	"
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Клиент.Наименование КАК Клиент,
	|	ЦеныСрезПоследних.Еда.Наименование КАК Еда,
	|	ЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПоследних(ДАТАВРЕМЯ(2014, 02, 01), Еда.Наименование = ""Клубника"") КАК ЦеныСрезПоследних
	|УПОРЯДОЧИТЬ ПО
	|	Клиент ВОЗР,
	|	Еда ВОЗР
	|ИТОГИ ПО
	|	ЦеныСрезПоследних.Клиент
	|";