
Процедура ЗашифроватьТекстШифромЦезаря(ПутьКФайлу)                                  
	ИсходныйФайл = Новый ТекстовыйДокумент;
	ИсходныйФайл.Прочитать(ПутьКФайлу, "UTF-8");
	
	ИсходныйТекст = ИсходныйФайл.ПолучитьТекст();
	ЗашифрованныйТекст = "";
	
	Для НомерСимвола = 1 По СтрДлина(ИсходныйТекст) Цикл
		ЗашифрованныйСимвол = Символ(КодСимвола(ИсходныйТекст, НомерСимвола) + 5);
		ЗашифрованныйТекст = ЗашифрованныйТекст + ЗашифрованныйСимвол;
	КонецЦикла;
	
	НовыйФайл = Новый ТекстовыйДокумент;
	НовыйФайл.УстановитьТекст(ЗашифрованныйТекст);
	НовыйФайл.Записать("D:\зашифрованный.txt");
		
КонецПроцедуры

Процедура РасшифроватьТекстШифромЦезаря(ПутьКФайлу)                                  
	ЗашифрованныйФайл = Новый ТекстовыйДокумент;
	ЗашифрованныйФайл.Прочитать(ПутьКФайлу, "UTF-8");
	
	ЗашифрованныйТекст = ЗашифрованныйФайл.ПолучитьТекст();
	РасшифрованныйТекст = "";
	
	Для НомерСимвола = 1 По СтрДлина(ЗашифрованныйТекст) Цикл
		РасшифрованныйСимвол = Символ(КодСимвола(ЗашифрованныйТекст, НомерСимвола) - 5);
		РасшифрованныйТекст = РасшифрованныйТекст + РасшифрованныйСимвол;
	КонецЦикла;
	
	НовыйФайл = Новый ТекстовыйДокумент;
	НовыйФайл.УстановитьТекст(РасшифрованныйТекст);
	НовыйФайл.Записать("D:\расшифрованный.txt");
		
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы() 
	
	ЗашифроватьТекстШифромЦезаря("D:\исходный.txt"); 
	РасшифроватьТекстШифромЦезаря("D:\зашифрованный.txt"); 

КонецПроцедуры



