// 169. Преобладающий элемент

// Дан массив nums размером n. Верните элемент большинства.

// Преобладающий элемент — это элемент, который встречается более [n / 2] раз. 
// Вы можете считать, что элемент большинства всегда существует в массиве. 

// Пример 1:
// Входные данные: nums = [3,2,3]
// Вывод: 3

// Пример 2:
// Ввод: nums = [2,2,1,1,1,2,2]
// Вывод: 2 

// Ограничения:
// n == числа.длина
// 1 <= n <= 5 * 10^4
// -10^9 <= числа[i] <= 10^9
 
// 169. Majority Element // LeetCode URL: https://leetcode.com/problems/majority-element/?envType=study-plan-v2&envId=top-interview-150

Функция ПреобладающийЭлемент(Массив)
    // Инициализация переменных
    Кандидат = Неопределено; // Кандидат на элемент большинства
    Счетчик = 0; // Счетчик для подсчета

    // Проходим по массиву для нахождения кандидата
    Для Каждого Элемент Из Массив Цикл
        Если Счетчик = 0 Тогда
            Кандидат = Элемент; // Новый кандидат
            Счетчик = 1; // Сбрасываем счетчик
        ИначеЕсли Элемент = Кандидат Тогда
            Счетчик = Счетчик + 1; // Увеличиваем счетчик
        Иначе
            Счетчик = Счетчик - 1; // Уменьшаем счетчик
        КонецЕсли;
    КонецЦикла;

    // Возвращаем кандидата
    Возврат Кандидат;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	// Пример 1
    Массив1 = Новый Массив;
	Массив1 = СтрРазделить("3,2,3", ",");
    ЭлементБольшинства1 = ПреобладающийЭлемент(Массив1);
    Сообщить("Преобладающий элемент: " + ЭлементБольшинства1);

	// Пример 2
	Массив2 = Новый Массив;
	Массив2 = СтрРазделить("2,2,1,1,1,2,2", ",");
    ЭлементБольшинства2 = ПреобладающийЭлемент(Массив2);
    Сообщить("Преобладающий элемент: " + ЭлементБольшинства2); 
КонецПроцедуры