// 122. Лучшее время для покупки и продажи акций II

// Вам дан целочисленный массив цен, где цены[i] — это цена акции в Индекс-й день.
// Каждый день вы можете принять решение о покупке и/или продаже акции. 
// В любой момент времени вы можете владеть не более чем одной акцией. 
// Однако вы можете купить её, а затем сразу же продать в тот же день.

// Найдите и верните максимальную прибыль, которую вы можете получить.

// Пример 1:
// Входные данные: цены = [7,1,5,3,6,4]
// Выходные данные: 7
// Объяснение: купите на второй день (цена = 1) и продайте на третий день (цена = 5), прибыль = 5-1 = 4.
// Затем покупаем на 4-й день (цена = 3) и продаём на 5-й день (цена = 6), прибыль = 6-3 = 3.
// Общая прибыль = 4 + 3 = 7.

// Пример 2:
// Ввод: цены = [1,2,3,4,5]
// Вывод: 4
// Объяснение: покупаем в день 1 (цена = 1) и продаём в день 5 (цена = 5), прибыль = 5-1 = 4.
// Общая прибыль составляет 4.

// Пример 3:
// Входные данные: цены = [7,6,4,3,1]
// Выходные данные: 0
// Объяснение: нет возможности получить положительную прибыль, поэтому мы никогда не покупаем акции, чтобы получить максимальную прибыль в 0.
 
// Ограничения:
// 1 <= цены.длина <= 3 * 10^4
// 0 <= цены[i] <= 10^4

// 122. Best Time to Buy and Sell Stock II // LeetCode URL: https://leetcode.com/problems/best-time-to-buy-and-sell-stock-ii/?envType=study-plan-v2&envId=top-interview-150

Функция МаксимальнаяПрибыль(Цены)
    // Инициализация переменной для хранения максимальной прибыли
    МаксимальнаяПрибыль = 0;

    // Проходим по массиву цен, начиная со второго элемента
    Для Индекс = 1 По Цены.Количество() - 1 Цикл
        // Если цена текущего дня больше предыдущей, фиксируем прибыль
        Если Цены[Индекс] > Цены[Индекс - 1] Тогда
            МаксимальнаяПрибыль = МаксимальнаяПрибыль + (Цены[Индекс] - Цены[Индекс - 1]);
        КонецЕсли;
    КонецЦикла;

    // Возвращаем максимальную прибыль
    Возврат МаксимальнаяПрибыль;
КонецФункции

// Пример использования
Процедура ПриНачалеРаботыСистемы()
    // Пример 1
    Массив1 = Новый Массив;
	Массив1 = СтрРазделить("7,1,5,3,6,4", ",");
    Прибыль1 = МаксимальнаяПрибыль(Массив1);
    Сообщить("Максимальная прибыль: " + Прибыль1);

    // Пример 2
    Массив2 = Новый Массив;
	Массив2 = СтрРазделить("1,2,3,4,5", ",");
    Прибыль2 = МаксимальнаяПрибыль(Массив2);
    Сообщить("Максимальная прибыль: " + Прибыль2);

    // Пример 3
    Массив3 = Новый Массив;
	Массив3 = СтрРазделить("7,6,4,3,1", ",");
    Прибыль3 = МаксимальнаяПрибыль(Массив3);
    Сообщить("Максимальная прибыль: " + Прибыль3);
КонецПроцедуры