// 55. Игра в прыжки

// Вам дан целочисленный массив nums. 
// Изначально вы находитесь в первом индексе массива, и каждый элемент массива представляет собой максимальную длину вашего прыжка в этой позиции.

// Верните true, если вы можете добраться до последнего индекса, или false в противном случае.

// Пример 1:
// Входные данные: nums = [2,3,1,1,4]
// Вывод: true
// Объяснение: перепрыгните на 1 шаг от индекса 0 к 1, затем на 3 шага к последнему индексу.

// Пример 2:
// Входные данные: nums = [3,2,1,0,4]
// Вывод: false
// Объяснение: вы всегда будете попадать в индекс 3, независимо от того, что делаете. Максимальная длина прыжка равна 0, что делает невозможным достижение последнего индекса.

// Ограничения:
// 1 <= длина массива nums. <= 10^4
// 0 <= nums[i] <= 10^5

// 55. Jump Game // LeetCode URL: https://leetcode.com/problems/jump-game/?envType=study-plan-v2&envId=top-interview-150

Функция МожноДостичьКонца(Числа)
    // Инициализация переменной для хранения самой дальней достижимой позиции
    СамаяДальняяПозиция = 0;

    // Проходим по массиву чисел
    Для Индекс = 0 По Числа.Количество() - 1 Цикл
        // Если текущая позиция недостижима, возвращаем Ложь
        Если Индекс > СамаяДальняяПозиция Тогда
            Возврат Ложь;
        КонецЕсли;

        // Обновляем самую дальнюю позицию
        СамаяДальняяПозиция = Макс(СамаяДальняяПозиция, Индекс + Числа[Индекс]);

        // Если можем достичь или перескочить последний индекс, возвращаем Истина
        Если СамаяДальняяПозиция >= Числа.Количество() - 1 Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;

    // Если цикл завершился, мы можем достичь конца
    Возврат Истина;
КонецФункции

// Пример использования
Процедура ПриНачалеРаботыСистемы()
    // Пример 1
    Массив1 = Новый Массив;
	Массив1 = СтрРазделить("2,3,1,1,4", ",");
    Результат1 = МожноДостичьКонца(Массив1);
    Сообщить("Можно ли достичь конца (Пример 1): " + Результат1);

    // Пример 2
    Массив2 = Новый Массив;
	Массив1 = СтрРазделить("3,2,1,0,4", ",");
    Результат2 = МожноДостичьКонца(Массив2);
    Сообщить("Можно ли достичь конца (Пример 2): " + Результат2);

КонецПроцедуры