// 274. Индекс Хирша (h-индекс)

// Учитывая массив целых чисел citations, где citations[i] — это количество цитирований, 
// полученных исследователем за его i-ю статью, верните h-индекс исследователя.

// Согласно определению h-индекса в Википедии: h-индекс определяется как максимальное значение h, 
// при котором данный исследователь опубликовал не менее h статей, каждая из которых была процитирована не менее h раз.

// Пример 1:
// Входные данные: количество цитирований = [3,0,6,1,5]
// Выходные данные: 3
// Пояснение: [3,0,6,1,5] означает, что у исследователя всего 5 статей, и каждая из них получила 3, 0, 6, 1, 5 цитирований соответственно.
// Поскольку у исследователя есть 3 статьи, каждая из которых получила не менее 3 цитирований, а остальные две — не более 3 цитирований, их h-индекс равен 3.

// Пример 2:
// Входные данные: citations = [1,3,1]
// Выходные данные: 1

// Пример 3:
// Входные данные: citations = [1, 1, 2, 3, 4, 5, 7, 8, 9, 9, 10, 12, 14, 15, 18, 20, 23, 23, 25, 27]
// Выходные данные: 10
 
// Ограничения:
// n == длина массива цитирований.
// 1 <= n <= 5000
// 0 <= citations[i] <= 1000

// 274. H-Index // LeetCode URL: https://leetcode.com/problems/h-index/?envType=study-plan-v2&envId=top-interview-150

Функция СортировкаСпискомЗначений(Знач Массив)
	мСписокЗнч = Новый СписокЗначений;
	мСписокЗнч.ЗагрузитьЗначения(Массив);
	мСписокЗнч.СортироватьПоЗначению(НаправлениеСортировки.Возр);    
	Возврат мСписокЗнч.ВыгрузитьЗначения();
КонецФункции


Функция ВычислитьИндексХирша(Цитирования)
	// Преобразуем строки в числа
    Для Индекс = 0 По Цитирования.Количество() - 1 Цикл
        Цитирования[Индекс] = Число(Цитирования[Индекс]);
    КонецЦикла;

    // Сортируем массив по возрастанию [0, 1, 3, 5, 6]
	Цитирования = СортировкаСпискомЗначений(Цитирования); 

    // Получаем длину массива
    ДлинаМассива = Цитирования.Количество();

    // Проверяем каждую статью
    Для Индекс = 0 По ДлинаМассива - 1 Цикл
        Если Цитирования[Индекс] >= ДлинаМассива - Индекс Тогда
			// текущая статья (Цитирования[Индекс]) имеет количество цитирований, не меньшее, чем количество статей,
	        // оставшихся до конца массива (ДлинаМассива - Индекс)
            Возврат ДлинаМассива - Индекс; // Возвращаем Индекс Хирша
        КонецЕсли;
    КонецЦикла;

    // Если все статьи не удовлетворяют условию
    Возврат 0;
КонецФункции

// Пример использования
Процедура ПриНачалеРаботыСистемы()
    // Пример 1
    Цитирования1 = Новый Массив;
	Цитирования1 = СтрРазделить("3,0,6,1,5", ",");
    HИндекс1 = ВычислитьИндексХирша(Цитирования1);
    Сообщить("H-индекс (Пример 1): " + HИндекс1);

    // Пример 2
    Цитирования2 = Новый Массив;
	Цитирования2 = СтрРазделить("1,3,1", ",");
    HИндекс2 = ВычислитьИндексХирша(Цитирования2);
    Сообщить("H-индекс (Пример 2): " + HИндекс2);

	// Пример 3
	Цитирования3 = Новый Массив;
	Цитирования3 = СтрРазделить("1, 1, 2, 3, 4, 5, 7, 8, 9, 9, 10, 12, 14, 15, 18, 20, 23, 23, 25, 27", ",");
	HИндекс3 = ВычислитьИндексХирша(Цитирования3);
	Сообщить("H-индекс (Пример 3): " + HИндекс3);

КонецПроцедуры