// 134. Заправочная станция
// Вдоль кольцевого маршрута расположено n заправочных станций, где количество газа на i-й станции равно gas[i].

// У вас есть автомобиль с неограниченным запасом бензина, и проезд от i-й станции до следующей (i + 1)-й стоит [i]. 
// Вы начинаете путешествие с пустым баком на одной из заправочных станций.

// Учитывая два целочисленных массива gas и cost, верните индекс начальной заправочной станции, 
// если вы можете проехать по маршруту один раз по часовой стрелке, в противном случае верните -1. 
// Если решение существует, оно гарантированно будет единственным.

// Пример 1:
// Входные данные: gas = [1,2,3,4,5], cost = [3,4,5,1,2]
// Выходные данные: 3
// Пояснение:
// Начните со станции 3 (индекс 3) и заправьте 4 единицы топлива. Ваш бак = 0 + 4 = 4
// Доезжайте до станции 4. Ваш бак = 4 - 1 + 5 = 8
// Доезжайте до станции 0. Ваш бак = 8 - 2 + 1 = 7
// Доезжайте до станции 1. Ваш бак = 7 - 3 + 2 = 6
// Доезжайте до станции 2. Ваш бак = 6 - 4 + 3 = 5
// Доезжайте до станции 3. Стоимость проезда — 5. У вас хватит бензина, чтобы вернуться на станцию 3.
// Поэтому верните 3 в качестве начального индекса.

// Пример 2:
// Входные данные: gas = [2, 3, 4], cost = [3, 4, 3]
// Выходные данные: -1
// Объяснение:
// Вы не можете начать со станции 0 или 1, так как у вас не хватит бензина, чтобы доехать до следующей станции.
//  Давайте начнём со станции 2 и заправимся 4 единицами бензина. Ваш бак = 0 + 4 = 4
//  Доезжайте до станции 0. Ваш бак = 4 - 3 + 2 = 3
//  Доезжайте до станции 1. Ваш бак = 3 - 3 + 3 = 3
// Вы не можете вернуться на станцию 2, так как для этого требуется 4 единицы бензина, а у вас их только 3.
// Следовательно, вы не можете проехать по кругу один раз, независимо от того, откуда вы начнёте.
 
// Ограничения:
// n == длина бензина. == длина затрат.
// 1 <= n <= 10^5
// 0 <= gas[i], cost[i] <= 10^4

// 134. Gas Station // LeetCode URL: https://leetcode.com/problems/gas-station/?envType=study-plan-v2&envId=top-interview-150

Функция МожетЗавершитьКруг(МассивТопливо, МассивРасход) Экспорт
    ОбщийБензин = 0; // Общее количество доступного топлива
    ОбщийРасход = 0; // Общая расход для прохождения маршрута
    Бак = 0; // Текущий объем топлива в баке
    СтартоваяСтанция = 0; // Кандидат для начальной станции

    // Проходим по всем станциям
    Для Индекс = 0 По МассивТопливо.Количество() - 1 Цикл
        ОбщийБензин = ОбщийБензин + МассивТопливо[Индекс];
        ОбщийРасход = ОбщийРасход + МассивРасход[Индекс];
        Бак = Бак + МассивТопливо[Индекс] - МассивРасход[Индекс];

        // Если в баке недостаточно топлива, нужно сменить стартовую станцию
        Если Бак < 0 Тогда
            Бак = 0; // Сбрасываем бак
            СтартоваяСтанция = Индекс + 1; // Переносим стартовую станцию на следующую
        КонецЕсли;
    КонецЦикла;

    // Если общий объем топлива меньше общей стоимости, пройти круг невозможно
	Если ОбщийБензин >= ОбщийРасход Тогда
        Возврат СтартоваяСтанция;
    Иначе
        Возврат -1;
    КонецЕсли;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
    // Пример 1
    МассивБензин1 = Новый Массив;
	МассивБензин1 = СтрРазделить("1,2,3,4,5", ",");
	МассивРасход1 = Новый Массив;
	МассивРасход1 = СтрРазделить("3,4,5,1,2", ",");
    СтартоваяCтанция1 = МожетЗавершитьКруг(МассивБензин1, МассивРасход1);
    Сообщить("Стартовая станция для примера 1: " + СтартоваяCтанция1);

    // Пример 2
    МассивБензин2 = Новый Массив;
	МассивБензин2 = СтрРазделить("2,3,4", ",");
	МассивРасход2 = Новый Массив;
	МассивРасход2 = СтрРазделить("3,4,3", ",");
    СтартоваяCтанция2 = МожетЗавершитьКруг(МассивБензин2, МассивРасход2);
    Сообщить("Стартовая станция для примера 2: " + СтартоваяCтанция2);
КонецПроцедуры