// 58. Длина последнего слова

// Дана строка s, состоящая из слов и пробелов. Верните длину последнего слова в строке.

// Слово — это максимальная подстрока, состоящая только из непробельных символов.

// Пример 1:
// Ввод: s = "Привет мир"
// Вывод: 5
// Объяснение: последнее слово — «Мир» длиной 3.

// Пример 2:
// Ввод: s = "   лети со мной на Луну  "
// Вывод: 4
// Объяснение: последнее слово — «Луну» длиной 4.

// Пример 3:
// Ввод: s = "Никто не может грустить когда у него есть воздушный шарик"
// Вывод: 6
// Объяснение: последнее слово — «шарик» длиной 5.
 
// Ограничения:
// 1 <= s.length <= 104
// s состоит только из английских букв и пробелов ' '.
// В s будет хотя бы одно слово.

// 58. Length of Last Word // LeetCode URL: https://leetcode.com/problems/length-of-last-word/?envType=study-plan-v2&envId=top-interview-150

Функция ДлинаПоследнегоСлова(Строка)
    Длина = 0; // Переменная для хранения длины последнего слова
    Индекс = СтрДлина(Строка); // Указатель на последний символ строки

    // Игнорируем конечные пробелы
    Пока Индекс >= 1 И Сред(Строка, Индекс, 1) = " " Цикл
        Индекс = Индекс - 1;
    КонецЦикла;

    // Считаем длину последнего слова
    Пока Индекс >= 1 И Сред(Строка, Индекс, 1) <> " " Цикл
        Длина = Длина + 1;
        Индекс = Индекс - 1;
    КонецЦикла;

    Возврат Длина; // Возвращаем длину последнего слова
КонецФункции

Процедура ПриНачалеРаботыСистемы()
    // Пример 1
    Строка1 = "Привет мир";
    Сообщить("Длина последнего слова в '" + Строка1 + "': " + ДлинаПоследнегоСлова(Строка1));

    // Пример 2
    Строка2 = "   лети со мной на Луну  ";
    Сообщить("Длина последнего слова в '" + Строка2 + "': " + ДлинаПоследнегоСлова(Строка2));

    // Пример 3
    Строка3 = "никто не может грустить когда у него есть воздушный шарик";
    Сообщить("Длина последнего слова в '" + Строка3 + "': " + ДлинаПоследнегоСлова(Строка3));

	// Пример 4
	Строка4 = "   ";
	Сообщить("Длина последнего слова в '" + Строка4 + "': " + ДлинаПоследнегоСлова(Строка4));
КонецПроцедуры