// 14. Самый длинный общий префикс

// Напишите функцию для поиска самого длинного общего префикса в массиве строк.

// Если общего префикса нет, верните пустую строку "". 

// Пример 1:
// Входные данные: strs = ["flower","flow","flight"]
// Выходные данные: "fl"

// Пример 2:
// Входные данные: strs = ["dog","racecar","car"]
// Выходные данные: ""
// Объяснение: во входных строках нет общего префикса.
 
// Ограничения:
// 1 <= strs.length <= 200
// 0 <= strs[i].length <= 200
// strs[i] состоит только из строчных букв английского алфавита, если оно не пустое.

// 14. Longest Common Prefix // LeetCode URL: https://leetcode.com/problems/longest-common-prefix/?envType=study-plan-v2&envId=top-interview-150

Функция НайтиОбщийПрефикс(МассивСтрок) 
    // Если массив пустой, возвращаем пустую строку, так как общий префикс отсутствует
    Если МассивСтрок = Неопределено Или МассивСтрок.Количество() = 0 Тогда
        Возврат ""; 
    КонецЕсли;

    // Берем первую строку как начальный префикс
    Префикс = МассивСтрок[0];

    // Проходим по всем строкам в массиве, начиная со второй
    Для Индекс = 1 По МассивСтрок.Количество() - 1 Цикл
        // Пока текущая строка не начинается с текущего префикса
        Пока Не СтрНачинаетсяС(МассивСтрок[Индекс], Префикс) Цикл
			// Укорачиваем префикс на один символ с конца
            Префикс = Лев(Префикс, СтрДлина(Префикс) - 1);
            // Если префикс стал пустым, возвращаем пустую строку
            Если Префикс = "" Тогда
                Возврат "";
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

	// Возвращаем найденный общий префикс
    Возврат Префикс;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
    // Пример 1
    МассивСтрок1 = Новый Массив;
    МассивСтрок1.Добавить("внутриклеточно");
    МассивСтрок1.Добавить("внутрикожно");
    МассивСтрок1.Добавить("внутримышечно");
	МассивСтрок1.Добавить("внутрикостно");
    Сообщить("Общий префикс для примера 1: " + НайтиОбщийПрефикс(МассивСтрок1));

    // Пример 2
    МассивСтрок2 = Новый Массив;
    МассивСтрок2.Добавить("квинтэссенция");
    МассивСтрок2.Добавить("бессмертие");
    МассивСтрок2.Добавить("всемогущество");
    Сообщить("Общий префикс для примера 2: " + НайтиОбщийПрефикс(МассивСтрок2));

    // Пример 3
    МассивСтрок3 = Новый Массив;
    МассивСтрок3.Добавить("квадрат");
    МассивСтрок3.Добавить("квадриллион");
    МассивСтрок3.Добавить("квадрокоптер");
    Сообщить("Общий префикс для примера 3: " + НайтиОбщийПрефикс(МассивСтрок3));
КонецПроцедуры

