// 151. Переставьте слова в строке в обратном порядке

// Дана входная строка s, переставьте слова в обратном порядке.

// Слово определяется как последовательность символов, отличных от пробела. 
// Слова в s будут разделены как минимум одним пробелом.

// Верните строку со словами в обратном порядке, разделёнными одним пробелом.

// Обратите внимание, что s может содержать ведущие или конечные пробелы или несколько пробелов между двумя словами. 
// В возвращаемой строке между словами должен быть только один пробел. 
// Не добавляйте лишних пробелов.

// Пример 1:
// Ввод: s = "а куда же ты идешь"
// Вывод: "идешь ты же куда а"

// Пример 2:
// Ввод: s = "  привет мир  "
// Вывод: "мир привет"
// Пояснение: Ваша перевёрнутая строка не должна содержать начальных или конечных пробелов.

// Пример 3:
// Входные данные: s = "кажется дождь   собирается"
// Выходные данные: "собирается дождь кажется"
// Пояснение: вам нужно заменить несколько пробелов между двумя словами на один пробел в перевёрнутой строке.
 
// Ограничения:
// 1 <= s.length <= 104
// s содержит английские буквы (прописные и строчные), цифры и пробелы ' '.
// В s есть хотя бы одно слово.

// 151. Reverse Words in a String // LeetCode URL: https://leetcode.com/problems/reverse-words-in-a-string/?envType=study-plan-v2&envId=top-interview-150

Функция ОбратныйПорядокСлов(Знач Строка)
    // Удаляем лишние пробелы в начале и конце строки
    Строка = СокрЛП(Строка);

    // Разбиваем строку на массив слов, используя пробел как разделитель
    Слова = СтрРазделить(Строка, " ");

    Результат = ""; // Переменная для хранения итоговой строки

    // Проходим по массиву слов в обратном порядке
    Для Индекс = 0 По Слова.Количество() - 1 Цикл 
		ОбратныйИндекс = Слова.Количество() - 1 - Индекс;

		Если Слова[ОбратныйИндекс] = "" Тогда
			Продолжить;
        КонецЕсли;

		// Если это не последнее слово, добавляем пробел между словами
        Результат = Результат + Слова[ОбратныйИндекс];
        Если ОбратныйИндекс > 0 Тогда
            Результат = Результат + " "; // Добавляем пробел между словами
        КонецЕсли;
    КонецЦикла;

    Возврат Результат; // Возвращаем итоговую строку
КонецФункции

Процедура ПриНачалеРаботыСистемы()
    // Пример 1
    Строка1 = "а куда же ты идешь";
    Сообщить("Результат для примера 1: " + ОбратныйПорядокСлов(Строка1));

    // Пример 2
    Строка2 = "  привет мир  ";
    Сообщить("Результат для примера 2: " + ОбратныйПорядокСлов(Строка2));

    // Пример 3
    Строка3 = "кажется дождь   собирается";
    Сообщить("Результат для примера 3: " + ОбратныйПорядокСлов(Строка3));
КонецПроцедуры