ЗапросТаблицаУмноженияДо10 = 
	"
	|ВЫБРАТЬ
	|	Числа1.Число КАК Множитель1,
	|	Числа2.Число КАК Множитель2,
	|	Числа1.Число * Числа2.Число КАК Произведение
	|ИЗ
	|	(ВЫБРАТЬ 1 КАК Число ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 2 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 3 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 4 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 5 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 6 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 7 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 8 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 9 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 10) КАК Числа1,
	|	
	|	(
	|	ВЫБРАТЬ 1 КАК Число ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 2 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 3 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 4 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 5 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 6 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 7 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 8 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 9 ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ 10) КАК Числа2
	|";