Процедура СгенерироватьПароли(КоличествоПаролей, ДлинаПаролей)
	ПарольныеСимволы = "`~!@#$%^&*()-=_+\|[]{};':\"",.<>/?abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890";
    КоличествоВозможныхСимволов = СтрДлина(ПарольныеСимволы);
	ГСЧ = Новый ГенераторСлучайныхЧисел();

	Для НомерПароля = 1 По КоличествоПаролей Цикл
		Пароль = "";
		Для ТекущаяДлина = 1 По ДлинаПаролей Цикл
			Пароль = Пароль + Сред(ПарольныеСимволы, ГСЧ.СлучайноеЧисло(1, КоличествоВозможныхСимволов), 1);
		КонецЦикла;
		Сообщить(Пароль);
	КонецЦикла;

КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	КоличествоПаролей = 0;
	ДлинаПаролей = 0;
	ВвестиЧисло(КоличествоПаролей);
	ВвестиЧисло(ДлинаПаролей);
	СгенерироватьПароли(КоличествоПаролей, ДлинаПаролей);
КонецПроцедуры