

ЗапросРеквизитыСправочникаЕда.Текст = 
	"
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Код"" КАК Реквизит,
	|	ТИПЗНАЧЕНИЯ(Код) КАК Тип
	|ИЗ
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Наименование"",
	|	ТИПЗНАЧЕНИЯ(Наименование)
	|ИЗ 
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Вкус"",
	|	ТИПЗНАЧЕНИЯ(Вкус)
	|ИЗ 
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Цвет"",
	|	ТИПЗНАЧЕНИЯ(Цвет)
	|ИЗ 
	|	Справочник.Еда
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Калорийность"",
	|	ТИПЗНАЧЕНИЯ(Калорийность)
	|ИЗ 
	|	Справочник.Еда
	|";

