// Программа для проверки является ли число простым
// Временная сложность O(n)
// Автор: Гордеев Никита, 2024

// Функция проверки, является ли число простым
Функция ЭтоПростоеЧислоБулево(Число)
	// Проверяем делимость от 2 до Число - 1
	Для Сч = 2 По (Число - 1) Цикл
		// Если число делится на Сч без остатка, то оно не простое
		Если (Число % Сч = 0) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Если делителей не найдено, число простое
	Возврат Истина;
КонецФункции

Процедура ЭтоПростоеЧислоСтрока(Число)
	
	ЧислоЯвляетсяПростым = Истина;
	Для Переменная = 2 По Число-1 Цикл
		Если Число % Переменная = 0 Тогда
				ЧислоЯвляетсяПростым = Ложь;
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	Если ЧислоЯвляетсяПростым = Истина Тогда
		Сообщить("Число простое"); 
	Иначе
		Сообщить("Число не простое");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()

	Число = 0;
	ВвестиЗначение(Число);
	Сообщить("Является ли " + Число + " простым числом? " + ЭтоПростоеЧислоБулево(Число));
	ЭтоПростоеЧислоСтрока(Число);

КонецПроцедуры
