// Программа для проверки является ли число четным
// Автор: Гордеев Никита, 2024

Функция ПроверитьНаЧетность(Число)
    // Вычисляем остаток от деления
    Остаток = Число % 2;

    // Проверяем на четность
    Если (Остаток = 0) Тогда
        Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура ПриНачалеРаботыСистемы()       
	
	Число1 = 1;
    Число2 = 2;       
	Число3 = 100;   
	Число4 = 135;  
	Число5 = 10000;  
	Число6 = 10307;
	Число7 = -99;  
	Число8 = -150;
                                                       
	Сообщить("Является ли число " + Число1 + " четным? " + ПроверитьНаЧетность(Число1));                                                            
    Сообщить("Является ли число " + Число2 + " четным? " + ПроверитьНаЧетность(Число2));
	Сообщить("Является ли число " + Число3 + " четным? " + ПроверитьНаЧетность(Число3));
	Сообщить("Является ли число " + Число4 + " четным? " + ПроверитьНаЧетность(Число4));
	Сообщить("Является ли число " + Число5 + " четным? " + ПроверитьНаЧетность(Число5));
	Сообщить("Является ли число " + Число6 + " четным? " + ПроверитьНаЧетность(Число6));
	Сообщить("Является ли число " + Число7 + " четным? " + ПроверитьНаЧетность(Число7));
	Сообщить("Является ли число " + Число8 + " четным? " + ПроверитьНаЧетность(Число8));

КонецПроцедуры
