Функция ВремяДоДатыРождения(ДатаРождения)            
	Сегодня = ТекущаяДата();
	ДеньРожденияВЭтомГоду = Дата(Год(Сегодня), Месяц(ДатаРождения), День(ДатаРождения));
	
	ОсталосьСекунд = ДеньРожденияВЭтомГоду - Сегодня;
	Если ОсталосьСекунд < 0 Тогда
		Возврат "Ваш день рождения в этом году уже прошёл :(";
	КонецЕсли;

	Возврат("До вашего дня рождения осталось " + ОсталосьСекунд + " секунд :)");
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	ДеньРожденияПользователя = '0001.01.01';
	ВвестиДату(ДеньРожденияПользователя, "Когда вы родились?");

	Сообщить(ВремяДоДатыРождения(ДеньРожденияПользователя));
КонецПроцедуры

Формат(, "")")