Процедура ПроверитьНаПалиндром(Строка)
	
	СтрокаЯвляетсяПалиндромом = Истина;   
	
	Начало = 1;
	Конец = СтрДлина(Строка);
	
	Пока (Начало < Конец) Цикл
		Если Сред(Строка, Начало, 1) <> Сред(Строка, Конец, 1) Тогда
			СтрокаЯвляетсяПалиндромом = Ложь;
			Прервать;
		КонецЕсли;
		Начало = Начало + 1;
		Конец = Конец - 1;
	КонецЦикла;
	
	Если СтрокаЯвляетсяПалиндромом = Истина Тогда 
		Сообщить("Строка является палиндромом");
	Иначе
		Сообщить("Строка не является палиндромом"); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	Строка = "";
	ВвестиСтроку(Строка, "Введите строку для проверки");
	ПроверитьНаПалиндром(Строка);
	
КонецПроцедуры

