Процедура МаксимальныйМинимальныйЭлементыИСумма(Числа)
	
	МинимальныйЭлемент = Числа[0];
	МаксимальныйЭлемент = Числа[0]; 
	СуммаЭлементов = 0;
	
	Для Индекс = 1 По 99 Цикл
		ТекущийЭлемент = Числа[Индекс];
		Если ТекущийЭлемент < МинимальныйЭлемент Тогда 
			МинимальныйЭлемент = Числа[Индекс];
		КонецЕсли; 
		
		Если ТекущийЭлемент > МаксимальныйЭлемент Тогда
			МаксимальныйЭлемент = Числа[Индекс];
		КонецЕсли;
		
		СуммаЭлементов = СуммаЭлементов + ТекущийЭлемент;
	КонецЦикла;   
	
	СреднееАрифметическое = СуммаЭлементов / 100;
	
	Сообщить("Максимальный: " + МаксимальныйЭлемент);
	Сообщить("Минимальный: " + МинимальныйЭлемент);
	Сообщить("Сумма: " + СуммаЭлементов);
	Сообщить("Среднее арифметическое: " + СреднееАрифметическое);
	
КонецПроцедуры   


Процедура ПриНачалеРаботыСистемы() 
	Числа = Новый Массив(100);
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Для Индекс = 0 По 99 Цикл  
		Числа[Индекс] = ГСЧ.СлучайноеЧисло(0, 1000);
	КонецЦикла;
	
	МаксимальныйМинимальныйЭлементыИСумма(Числа);
	
КонецПроцедуры