Процедура ЧерезСтруктуру(ГодПользователя)
	События = Новый Структура("1961, 1861, 988, 1991, 1945, 862");
	События.1961 = "Полет Гагарина";
	События.1861 = "Отмена крепостного права в России";
	События.988 = "Крещение Руси";
	События.1945 = "Окончание Великой Отечественной войны";
	События.862 = "Основание Руси";

	Сообщить(События.Число(ГодПользователя));

	КонецПроцедуры

Процедура ЧерезМассив(ГодПользователя)
	События = Новый Массив(5, 2);

	События[0][0] = 1961;
	События[0][1] = "Полет Гагарина";
	События[1][0] = 1861;
	События[1][1] = "Отмена крепостного права в России";
	События[2][0] = 988;
	События[2][1] = "Крещение Руси";
	События[3][0] = 1945;
	События[3][1] = "Окончание Великой Отечественной войны";	
	События[4][0] = 862;
	События[4][1] = "Основание Руси";	
	
	Для Элемент = 0 По 4 Цикл
		Если События[Элемент] = ГодПользователя Тогда
			Сообщить(События[Элемент][1]);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЧерезСписокЗначений(ГодПользователя)
	События = Новый СписокЗначений;

	События.Добавить(1961, "Полет Гагарина");
	События.Добавить(1861, "Отмена крепостного права в России");
	События.Добавить(988, "Крещение Руси");
	События.Добавить(1945, "Окончание Великой Отечественной войны");
	События.Добавить(862, "Основание Руси");
	
	Найденный = События.НайтиПоЗначению(ГодПользователя);
	Сообщить(Найденный.Представление);
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	ГодПользователя = 0;
	ВвестиЧисло(ГодПользователя);
	ЧерезСтруктуру(ГодПользователя);
	ЧерезМассив(ГодПользователя);
	ЧерезСписокЗначений(ГодПользователя);

КонецПроцедуры