Функция ЗаполнитьСписокЗначений(События)
	События.Добавить(1961, "Полет Гагарина");
	События.Добавить(1861, "Отмена крепостного права в России");
	События.Добавить(988, "Крещение Руси");
	События.Добавить(1945, "Окончание Великой Отечественной войны");
	События.Добавить(862, "Основание Руси");
	
	Возврат События;
КонецФункции

Процедура СообщитьВопрос(События)
	Текст = "";
	Для Каждого Событие Из События Цикл
		Текст = Текст + Символы.ПС + Строка(Событие.Значение) + " - " + Элемент.Представление;
	КонецЦикла;

	Ответ = Вопрос(
		Текст + Символы.ПС + 
		"[1] - ввести новое событие" + Символы.ПС + 
		"[2] - очистить список значений" + Символы.ПС + 
		"[3] - сортировать события по году" + Символы.ПС +  
		"[4] - вывести все события на определенную дату" + Символы.ПС +
		"Введите номер команды или нажмитие ""Отмена"" для выхода из справочника событий",
		РежимДиалогаВопрос.ОКОтмена
	);
	
	Возврат Ответ;
КонецПроцедуры;

Процедура ПриНачалеРаботыСистемы()
	События = Новый СписокЗначений;
	События = ЗаполнитьСписокЗначений(События);

	Пока Истина Цикл
		Ответ = СообщитьВопрос(События);

		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Прервать;
		ИначеЕсли Ответ = КодВозвратаДиалога.Ок Тогда
			
		ВыборДействия = 0;
		ВвестиЧисло(ВыборДействия, "Выберите действие");)

		Если ВыборДействия = 1 Тогда
			
			НовоеСобытиеЗначение = "";
			НовоеСобытиеПредставление = 0;
			
			ВвестиЗначение(НовоеСобытиеЗначение, "Введите название события");
			ВвестиЗначение(НовоеСобытиеПредставление, "Введите год события");
			События.Добавить(НовоеСобытиеПредставление, НовоеСобытиеЗначение);

		ИначеЕсли ВыборДействия = 2 Тогда
			
			Результа = Вопрос("Вы уверены", РежимДиалогаВопрос.ДаНет);
			Если Результат = КодВозвратаДиалога.Да Тогда	
				События.Очистить();
			КонецЕсли;

		ИначеЕсли ВыборДействия = 3 Тогда
			
			События.СортироватьПоЗначению(НаправлениеСортировки.Возр);

		ИначеЕсли ВыборДействия = 4 Тогда
			
			Год = 0;
			ВвестиЧисло(Год, "Введите год");
			
			Если События.НайтиПоЗначению(ГодСобытия) = Неопределено Тогда
				ОткрытьЗначение("Извините, в этот год ничего не произошло");
			Иначе
				НужныеСобытия = "";
				Для Каждого Событие из События Цикл
					Если ГодСобытия = Событие.Значение Тогда
						НужныеСобытия = НужныеСобытия + Символы.ПС + Строка(Событие.Значение) + " - " + Событие.Представление;
					КонецЕсли;
				КонецЦикла;
				ОткрытьЗначение(НужныеСобытия);
			КонецЕсли;

	КонецЦикла;

КонецПроцедуры