
Запрос9.Текст = 
	"ВЫБРАТЬ 
	|	Цвет,
	|	Сумма(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет";

Запрос10.Текст = 
	"ВЫБРАТЬ
	|	Цвет, 
	|	СРЕДНЕЕ(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет";

Запрос11.Текст = 
	"ВЫБРАТЬ 
	|	Цвет, 
	|	Минимум(Калорийность)
	|ИЗ 
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет";

Запрос12.Текст = 
	"ВЫБРАТЬ
	|	Цвет,
	|	Максимум(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО 
	|	Цвет";

Запрос13.Текст = 
	"ВЫБРАТЬ
	|	Цвет,
	|	КОЛИЧЕСТВО(Калорийность)
	|ИЗ 
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет";

Запрос14.Текст = 
	"ВЫБРАТЬ 
	|	Цвет, 
	|	Количество(РАЗЛИЧНЫЕ Калорийность)
	|ИЗ
	|	Справочник.Еда
	|Сгруппировать ПО 
	|	Цвет";

Запрос15.Текст = 
	"ВЫБРАТЬ
	|	Вкус
	|ИЗ 
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Вкус";

Запрос16.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Калорийность) КАК Сумма,
	|	СРЕДНЕЕ(Калорийность) КАК Среднее,
	|	МИНИМУМ(Калорийность) КАК Минимум,
	|	МАКСИМУМ(Калорийность) КАК Максимум,
	|	КОЛИЧЕСТВО(Калорийность) КАК Количество
	|ИЗ 
	|	Справочник.Еда";

Запрос17.Текст = 
	"ВЫБРАТЬ 
	|	Наименование,
	|	Вкус,
	|	Цвет,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ГДЕ
	|	Цвет.Наименование = Желтый";

Запрос18.Текст =
	"ВЫБРАТЬ 
	|	Наименование,
	|	Цвет,
	|	Калорийность
	|ИЗ
	|	Справочник.Еда
	|ГДЕ 
	|	Цвет.Наименование = ""Белый"" ИЛИ Калорийность > 100";

Запрос19.Текст = 
	"ВЫБРАТЬ 
	|	Цвет,
	|	СУММА(Калорийность)
	|ИЗ
	|	Справочник.Еда
	|СГРУППИРОВАТЬ ПО
	|	Цвет
	|ИМЕЮЩИЕ
	|	СУММА(Калорийнось)>100";

	ЗапросССложнымУсловием.Текст = 
	"
	|ВЫБРАТЬ
	|	Наименование
	|ИЗ 
	|	Справочник.Вкусы
	|ГДЕ
	|	Наименование <> ""Солёный"
	";
	
Запрос.Текст = 
	"
	|ВЫБРАТЬ 
	|	Наименование
	|ИЗ 
	|	Справочник.Еда
	|Где
	|	Вкус.Наименование = "Сладкий" ИЛИ 
	|	Вкус.Наименование = "Кислый"
	|";
