ЗапросКоличествоЗаказанныхБанановАндреем.Текст = 
	"
	|ВЫБРАТЬ
	|	Обороты.Клиент,
	|	Обороты.Еда,
	|	Обороты.КоличествоОборот КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты() КАК Обороты
	|ГДЕ
	|	Обороты.Еда.Наименование = "Банан" И
	|	Обороты.Клиент.Наименование = "Андрей"
	|";

	ЗапросКоличествоЗаказанныхБанановАндреем.Текст = 
	"
	|ВЫБРАТЬ
	|	Обороты.Клиент,
	|	Обороты.Еда,
	|	Обороты.КоличествоОборот КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(
	|		,,, Обороты.Еда.Наименование = "Банан" И
	|	Обороты.Клиент.Наименование = "Андрей") КАК Обороты
	|";