ЗапросОплатыИзКассыПоставщикуЗаЯнварь.Текст = 
	"
	|ВЫБРАТЬ
	|	Движения.Период КАК Дата,
	|	Движения.СчетДт КАК Дт,
	|	Движения.СубконтоДт1 КАК Контрагент,
	|	Движения.СчетКт КАК Кт,
	|	Движения.Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|		ДАТАВРЕМЯ(2014, 01, 01), ДАТАВРЕМЯ(2014, 01, 31),
	|		СчетДт.Код = ""60.01"" И СчетКт.Код = ""50.01"" И 
	|		СубконтоДт1.Наименование = ""ООО """"Ремкомплект""""""
	|	) КАК Движения
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|";

ЗапросОтгрузкиТовараПоСкладамЗаФевраль.Текст =
	"
	|ВЫБРАТЬ
	|	Движения.СубконтоКт1 КАК Склад,
	|	Движения.Период КАК Дата,
	|	Движения.СчетДт КАК Дт,
	|	Движения.СубконтоДт2 КАК Контрагент,
	|	Движения.СчетКт КАК Кт,
	|	Движения.СубконтоКт2 КАК Товар,
	|	Движения.Сумма,
	|	Движения.КоличествоКТ КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|		ДАТАВРЕМЯ(2014, 02, 01), ДАТАВРЕМЯ(2014, 02, 28),
	|		СчетДт.Код = ""62.01"" И СчетКт.Код = ""41.01""
	|	) КАК Движения
	|УПОРЯДОЧИТЬ ПО
	|	Движения.СубконтоКт1.Наименование,
	|	Период
	|ИТОГИ ПО
	|	Склад
	|";

ЗапросКоличествоИСуммаПоступившегоТовараНаОсновнойСклад.Текст = 	
	"
	|ВЫБРАТЬ
	|	СчетДт КАК Счет,
	|	СубконтоДт1 КАК Склад,
	|	СуммаОборот КАК Сумма,
	|	КоличествоОборотДт КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		ДАТАВРЕМЯ(2014, 03, 01), ДАТАВРЕМЯ(2014, 03, 31),,
	|		СчетДт.Код = ""41.01"",,,, 
	|		СубконтоДт1.Наименование = ""Основной""
	|)";

ЗапросКоличествоИСуммаПроданногоТовара.Текст = 
	"
	|ВЫБРАТЬ
	|	Период,
	|	СчетКт,
	|	СубконтоКт1.Наименование КАК Склад,
	|	СуммаОборот КАК Сумма,
	|	КоличествоОборотКт КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		,, Месяц,
	|		,, СчетКт.Код = ""41.01"",,
	|		СубконтоКт1.Наименование = ""Дополнительный""	
	|	)
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|";

ЗапросКоличествоДенегПоступившееВКассуОтПокупателей.Текст = 
	"
	|ВЫБРАТЬ
	|	СчетДт,
	|	СубконтоКт1 КАК Клиент,
	|	СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|		,,, СчетДт.Код = ""50.01"",, СчетКт.Код = ""62.01"",
	|	)
	|УПОРЯДОЧИТЬ ПО
	|	СубконтоКт1.Наименование
	|";

ЗапросПоступилоИПроданоБанановСДополнительногоСклада.Текст = 
	"
	|ВЫБРАТЬ
	|	СубконтоДт1 КАК Склад,
	|	СубконтоДт2 КАК Еда,
	|	КоличествоОборотДт КАК КупленоШтук
	|ПОМЕСТИТЬ
	|	КупленоВТ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|	,,, СчетДт.Код = ""41.01"" ,,,,
	|	СубконтоДт1.Наименование = ""Дополнительный"" И
	|	СубконтоДт2.Наименование = ""Банан""
	|	) КАК Куплено
	|
	|;
	|
	|ВЫБРАТЬ
	|	СубконтоКт1 КАК Склад,
	|	СубконтоКт2 КАК Еда,
	|	КоличествоОборотКт КАК ПроданоШтук
	|ПОМЕСТИТЬ
	|	ПроданоВТ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|	,,, ,, СчетКт.Код = ""41.01"",,
	|	СубконтоКт1.Наименование = ""Дополнительный"" И
	|	СубконтоКт2.Наименование = ""Банан"") КАК Продано
	|	
	|;
	|	
	|ВЫБРАТЬ
	|	КупленоВТ.Склад,
	|	КупленоВТ.Еда,
	|	КупленоВТ.КупленоШтук,
	|	ПроданоВТ.ПроданоШтук
	|ИЗ
	|	КупленоВТ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ПроданоВТ
	|ПО
	|	КупленоВТ.Еда = ПроданоВТ.Еда
	|";

ЗапросОстатокБанановНаСкладе.Текст = 
	"
	|ВЫБРАТЬ
	|	Субконто1.Наименование Склад,
	|	Субконто2.Наименование Еда,
	|	КоличествоОстатокДт Остаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(,
	|		Счет.Код = "41.01", ,
	|		Субконто1.Наименование = "Дополнительный" И 
	|		Субконто2.Наименование = "Банан"
	|	)
	|";