Функция ПроверитьЧислоНаПростоту(Число)
	
	ЧислоЯвляетсяПростым = Истина;
	Для Переменная = 2 По Число-1 Цикл
		Если Число % Переменная = 0 Тогда
			ЧислоЯвляетсяПростым = Ложь;
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЧислоЯвляетсяПростым;
	
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	Строка = "";
	Для Переменная = 1 По 1000 Цикл
		Если ПроверитьЧислоНаПростоту(Переменная) = Истина Тогда
			Строка = Строка + Переменная + " ";
		КонецЕсли;
	КонецЦикла;
	
	Сообщить(Строка);
	
КонецПроцедуры
