Процедура ПриНачалеРаботыСистемы()
Массив  = Новый Массив;

// Двумерный массив
НоваяСтрокаМассива = Новый Массив;
НоваяСтрокаМассива.Добавить(1);
НоваяСтрокаМассива.Добавить(2);
Массив.Добавить(НоваяСтрокаМассива);

НоваяСтрокаМассива = Новый Массив;
НоваяСтрокаМассива.Добавить(6);
НоваяСтрокаМассива.Добавить(7);
Массив.Добавить(НоваяСтрокаМассива);

Для каждого СтрокаМассива Из Массив Цикл
	Сообщить(СтрокаМассива);
КонецЦикла

Массив = Новый Массив;
СтрокаМассива = Новый Структура("ФИО, ДатаРождения");
СтрокаМассива.ФИО = "Иванов Иван Иванович";
СтрокаМассива.ДатаРождения = Дата(2000, 05, 07);
Массив.Добавить(СтрокаМассива);
СтрокаМассива.ФИО = "Петров Пётр Петрович";
СтрокаМассива.ДатаРождения = Дата(1990, 04, 06);
Массив.Добавить(СтрокаМассива);
 
Сообщить(Массив[1].ФИО);     // Выведет "Петров Пётр Петрович", как и ожидалось
Сообщить(Массив[0].ФИО);     // Тоже выведет "Петров Пётр Петрович" потому что
                             // элементы массива ссылаются на одну и ту же структуру
 
Массив[0].ФИО = "Сидоров Сидор Сидорович";
Сообщить(СтрокаМассива.ФИО); // Получаем "Сидоров Сидор Сидорович", ведь
                             // меняется сама структура
 
СтрокаМассива = Новый Структура("ФИО, ДатаРождения");
СтрокаМассива.ФИО = "Иванов Иван Иванович";
СтрокаМассива.ДатаРождения = Дата(2000, 05, 07);
Массив[0] = СтрокаМассива;
 
Сообщить(Массив[1].ФИО);     // По прежнему выведет "Сидоров Сидор Сидорович"
Сообщить(Массив[0].ФИО);     // А вот сейчас здесь "Иванов Иван Иванович".

Для каждого СтрокаМассива Из Массив Цикл
	Сообщить(СтрокаМассива);
КонецЦикла;

КонецПроцедуры