// Программа для проверки является ли число простым
// Временная сложность O(n)
// Автор: Гордеев Никита, 2024

// Функция проверки, является ли число простым
Функция ЭтоПростоеЧисло(Число)
	// Проверяем делимость от 2 до Число - 1
	Для Сч = 2 По (Число - 1) Цикл
		// Если число делится на Сч без остатка, то оно не простое
		Если (Число % Сч = 0) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Если делителей не найдено, число простое
	Возврат Истина;
КонецФункции

Процедура ПриНачалеРаботыСистемы()

	Число = 7;
	Сообщить("Является ли " + Число + " простым числом? " + ЭтоПростоеЧисло(Число));

КонецПроцедуры
