 

Процедура ОтсортироватьМассивПузырьковойСортировкой(Числа) 
	
	Пока Истина Цикл
		
		БылиЛиПерестановки = Ложь;
		
		Для Индекс = 1 По 99 Цикл  
			Если Числа[Индекс-1] > Числа[Индекс] Тогда  
				Буфер = Числа[Индекс-1];
				Числа[Индекс-1] = Числа[Индекс];
				Числа[Индекс] = Буфер; 
				БылиЛиПерестановки = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если БылиЛиПерестановки = Ложь Тогда
			Прервать;    
		КонецЕсли;  
		
	КонецЦикла;     
	
	Строка = "";
	Для Каждого Элемент из Числа Цикл 
		Строка = Строка + Элемент + " ";
	КонецЦикла;      
	Сообщить(Строка);
	
КонецПроцедуры 

		
Процедура ПриНачалеРаботыСистемы() 
	Числа = Новый Массив(100);
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Для Индекс = 0 По 99 Цикл  
		Числа[Индекс] = ГСЧ.СлучайноеЧисло(0, 1000);
	КонецЦикла;
	
	МаксимальныйМинимальныйЭлементыИСумма(Числа);
	ОтсортироватьМассивПузырьковойСортировкой(Числа);
	
КонецПроцедуры