// Типы данных дата
// Автор: Гордеев Никита, 2025


Процедура ПриНачалеРаботыСистемы()

	// =========================== инициализировать дату =========================== 
	
	ПеременнаяГГГГММДД = '20120314'; //(ГГГГММДД) 
	Сообщить("Дата: " + ПеременнаяГГГГММДД); // 14.03.2012 0:00:00

	ПеременнаяГГГГММДДЧЧММСС = '20120314172210'; //(ГГГГММДДЧЧММСС) 
	Сообщить("Дата: " + ПеременнаяГГГГММДДЧЧММСС); // 14.03.2012 17:22:10

	ПеременнаяЛюбыеРазделители = '2012.03.14.17.22.10';
	Сообщить("Дата: " + ПеременнаяЛюбыеРазделители); // 14.03.2012 17:22:10

	ПеременнаяФункцияДата = Дата(2012, 03, 14); // специальная команда-конструктор
	Сообщить("Дата: " + ПеременнаяФункцияДата); // 14.03.2012 0:00:00

	ПеременнаяПустаяДата = Дата(1,1,1);  
	Сообщить("Дата: " + ПеременнаяПустаяДата); // 01.01.0001 0:00:00

	ДатаОтПользователя = '00010101';
	ВвестиДату(ДатаОтПользователя);
	ОткрытьЗначение(ДатаОтПользователя);

	// =========================== преобразовать строку в дату ===========================
	
	МояДата = Дата("20130724");
	Сообщить("Дата: " + ПеременнаяКонецДня);
	
	// =========================== получить текущую дату в 1с ===========================
	
	Сегодня = ТекущаяДата();  
	Сообщить("Дата: " + Формат(Сегодня, "ДЛФ=ДАТА"));  
	
	Г =  Год(Сегодня); 
    М =  Месяц(Сегодня); 
    Д =  День(Сегодня); 
    Ч =  Час(Сегодня); 
    Ми = Минута(Сегодня); 
    С =  Секунда(Сегодня);
		
	// =========================== операции над датой ===========================
	
	Дата = '2025.01.01.20.01.03'; 
 
 	// месяц
    Сообщить(Формат(Дата, "ДФ=М")); // 1
    Сообщить(Формат(Дата, "ДФ=ММ")); // 01
    Сообщить(Формат(Дата, "ДФ=МММ")); // янв.
    Сообщить(Формат(Дата, "ДФ=ММММ")); // Январь
 
    // день
    Сообщить(Формат(Дата, "ДФ=д")); // 1
    Сообщить(Формат(Дата, "ДФ=дд")); // 01
    Сообщить(Формат(Дата, "ДФ=ддд")); // Ср
    Сообщить(Формат(Дата, "ДФ=дддд")); // среда
 
    // час
    Сообщить(Формат(Дата, "ДФ=ч")); // 8
    Сообщить(Формат(Дата, "ДФ=чч")); // 08
    Сообщить(Формат(Дата, "ДФ=Ч")); // 20
    Сообщить(Формат(Дата, "ДФ=ЧЧ")); // 20
 
    // минута
    Сообщить(Формат(Дата, "ДФ=м")); // 1
    Сообщить(Формат(Дата, "ДФ=мм")); // 01
 
    // секунда
    Сообщить(Формат(Дата, "ДФ=с")); // 3
    Сообщить(Формат(Дата, "ДФ=сс")); // 03
	
	// локальный формат даты
	Сообщить(Формат(Дата, "ДЛФ=Д")); // 01.01.2005
    Сообщить(Формат(Дата, "ДЛФ=ДД")); // 1 января 2005 г.
    Сообщить(Формат(Дата, "ДЛФ=В")); // 20:01:03
    Сообщить(Формат(Дата, "ДЛФ=ДДВ")); // 1 января 2005 г. 20:01:03
    Сообщить(Формат(Дата, "ДЛФ=ДВ")); // 01.01.2005 20:01:03

	ПеременнаяКонецМесяца = КонецМесяца(Сегодня);
	Сообщить("Дата: " + ПеременнаяКонецМесяца);

	ПеременнаяКонецГода = КонецГода(Сегодня);
	Сообщить("Дата: " + ПеременнаяКонецГода);

	ПеременнаяНачалоДня = НачалоДня(Сегодня);
	Сообщить("Дата: " + ПеременнаяНачалоДня);

	ПеременнаяНачалоГода = НачалоГода(Сегодня);
	Сообщить("Дата: " + ПеременнаяНачалоГода);

	ПеременнаяНачалоМесяца = НачалоМесяца(Сегодня);
	Сообщить("Дата: " + ПеременнаяНачалоМесяца);

	ПеременнаяСледующаяСекунда = Сегодня + 1; // добавили секунду
	Сообщить("Дата: " + ПеременнаяСледующаяСекунда);

	ПеременнаяСледующийДень = Сегодня + 60*60*24; // добавили сутки
	Сообщить("Дата: " + ПеременнаяСледующийДень);

	ПеременнаяСледующийДень = ДобавитьМесяц(Сегодня,3); // добавили 3 месяца
	Сообщить("Дата: " + ПеременнаяСледующийДень);

	// вычислить минимальное из нескольких значений
	Сообщить(Мин(Сегодня, ДобавитьМесяц(Сегодня, 1)));

	// вычислить максимальное из нескольких значений
	Сообщить(Макс(Сегодня, ДобавитьМесяц(Сегодня, 1)));
	

КонецПроцедуры