// Булевская логика
// Автор: Гордеев Никита, 2024

Процедура ПриНачалеРаботыСистемы()
	
	// Булево (Истина или Ложь)
	ПеременнаяБулево = Истина;  
	Сообщить("Булево: " + ПеременнаяБулево);
	
	// Неопределено
	ПеременнаяНеопределено = Неопределено;  
	Если ПеременнаяНеопределено = Неопределено Тогда
		Сообщить("Переменная содержит значение 'Неопределено'");
	КонецЕсли;
	
	// NULL
	ПеременнаяNULL = NULL;  
	Если ПеременнаяNULL = NULL Тогда
		Сообщить("Переменная содержит значение 'NULL'");
	КонецЕсли;
	

	// =========================== булевская логика ===========================

	// Оператор И
	Результат = Истина И Истина; // Результат = Истина
	Сообщить("Результат: " + Результат);
	
	Результат = Истина И Ложь; // Результат = Ложь
	Сообщить("Результат: " + Результат);
	
	Результат = Ложь И Ложь; // Результат = Ложь
	Сообщить("Результат: " + Результат);
	
	// Оператор ИЛИ
	Результат = Истина ИЛИ Истина; // Результат = Истина
	Сообщить("Результат: " + Результат);
	
	Результат = Истина ИЛИ Ложь; // Результат = Истина
	Сообщить("Результат: " + Результат);
	
	Результат = Ложь ИЛИ Ложь; // Результат = Ложь
	Сообщить("Результат: " + Результат);
	
	// =========================== операции ===========================
	

	// вычислить максимальное из нескольких значений
	Сообщить(Макс(Истина, Ложь)); // Истина

	// вычислить минимальное из нескольких значений
	Сообщить(Мин(Истина, Ложь)); // Ложь

	// вычислить выражение из строки
	Сообщить(Вычислить("ИСТИНА И ЛОЖЬ")); // Нет

КонецПроцедуры