Процедура ПриНачалеРаботыСистемы()
	
	// =========================== создание массива ===========================
	// массив из 3х элементов
	Числа = Новый Массив(3);

	// инициализируем их значениями
	Числа[0] = 5;
	Числа[1] = Числа[0] * 2; // 10
	Числа[2] = Числа[1] * 2; // 20

	Для Каждого ЭлементМассива из Числа Цикл
		Сообщить(ЭлементМассива); // 5 10 20
	КонецЦикла;
	

	// массив элементов различных типов неограниченной длины
    Значения = Новый Массив;
    Значения[0] = "Строка"; // строка
    Значения[1] = 123; // число
    Значения[2] = '20250205'; // дата
    Значения[3] = Истина; // булево
 
    Для Каждого ЭлементМассива из Значения Цикл
        Сообщить(ЭлементМассива); 
    КонецЦикла;



	// Двумерный массив
	ДвумерныйМассив  = Новый Массив(3, 2); // ( ( (), () ), ( (), () ), ( (), () ) )

	ДвумерныйМассив[0][0] = "Юрий";
	ДвумерныйМассив[0][1] = "Гагарин"; // ( ( "Юрий", "Гагарин" ), ( (), () ), ( (), () ) )
	
	ДвумерныйМассив[1][0] = "Герман";
	ДвумерныйМассив[1][1] = "Титов"; // ( ( "Юрий", "Гагарин" ), ( "Герман", "Титов" ), ( (), () ) )
	
	ДвумерныйМассив[2][0] = "Валентина";
	ДвумерныйМассив[2][1] = "Терешкова"; // ( ( "Юрий", "Гагарин" ), ( "Герман", "Титов" ), ( "Валентина", "Терешкова" ) )
	
	Для Каждого Строка Из ДвумерныйМассив Цикл
		Сообщить(Строка[0] + " " + Строка[1]);
	КонецЦикла;


	// =========================== операции над массивами =========================== 
	// последний элемент массива
	Животные = Новый Массив;
	Животные.Добавить("Кошка");
	Животные.Добавить("Собака");
	Животные.Добавить("Пантера");
	Животные.Добавить("Тигр");
	Сообщить(Животные[Животные.Количество() - 1]); // Тигр


	// Вставка в массив
	Числа = Новый Массив;
	Числа.Вставить(0, 10); // вставка на 0 позицию. Числа: (10)
	Числа.Вставить(0, 100); // (100, 10)
	Числа.Вставить(0, 1000); // (1000, 100, 10)
	Сообщить(Числа.ВГраница()); // // определение последнего индекса - 2
	Для Индекс = 0 по Числа.ВГраница() Цикл // вывод на печать
        Сообщить(Числа[Индекс]); // 1000 100 10
    КонецЦикла;
	

	// удаление элемента со значением 100
	Индекс = Числа.Найти(100); // находим индекс элемента - 1
	Числа.Удалить(Индекс); // удаляем элемент по найденному индексу (1000, 10)


	// удаление всех элементов из массива
	Числа.Очистить();


	// обойти все элементы массива по индексу
    Числа2 = Новый Массив;
    Числа2.Добавить(100);
    Числа2.Добавить(300);
    Числа2.Добавить(500);
 

    // пробегаемся от первого (с индексом 0) до последнего элемента (с индексом Количество - 1).
    Для Индекс = 0 По Числа2.Количество() - 1 Цикл
        Сообщить(Числа2[Индекс]);
    КонецЦикла;

	
	// неизменяемый массив 
	Числа = Новый Массив;
    Числа.Добавить(1);
    Числа.Добавить(2);
    Числа.Добавить(3);
    ФиксированныеЧисла = Новый ФиксированныйМассив(Числа);

КонецПроцедуры