// В Python аналогом является словарь (dict)
// Структура представляет собой коллекцию пар «ключ-значение», где ключи являются строками, а значения могут быть любого типа.

Процедура ПриНачалеРаботыСистемы()

	// =========================== создать структуру ===========================
	// вариант 1
	ЛичныеДанные = Новый Структура;
    // пара ключ (имя переменной) - значение (произв. типа)
    ЛичныеДанные.Вставить("Фамилия", "Иванов");
    ЛичныеДанные.Вставить("Имя", "Иван");
    ЛичныеДанные.Вставить("ДатаРождения", '19800802');
    Сообщить(ЛичныеДанные.Имя + " " + ЛичныеДанные.Фамилия + " родился " + ЛичныеДанные.ДатаРождения);

	// вариант 2
	Время = Новый Структура("Часы,Минуты,Секунды", 12, 45, 33);
    Сообщить("Время " + Время.Часы + ":" + Время.Минуты + ":" + Время.Секунды);
 
	// =========================== операции со структурами ===========================

	// изменить значение поля созданной структуры
	ЛичныеДанные.Вставить("Фамилия", "Сидоров");

	// изменить значение поля созданной структуры
	Время.Часы = 13;

	// количество элементов структуры
	Сообщить(Время.Количество());

	// обойти все элементы структуры
    Для Каждого Элемент Из ЛичныеДанные Цикл
        Сообщить(Элемент.Ключ + " " + Элемент.Значение);
    КонецЦикла;

	// удалить элемент структуры
	ЛичныеДанные.Удалить("ДатаРождения");

	// очистить все элементы структуры
	ЛичныеДанные.Очистить();

КонецПроцедуры