// В Python аналогом является словарь (dict)
// Соответствие также представляет собой коллекцию пар «ключ-значение», но в отличие от структуры, ключами могут быть значения практически любого типа, включая числа, строки и даже ссылки на объекты.

Процедура ПриНачалеРаботыСистемы()
 
    // =========================== создать соответствие ===========================
 
    СобытияДаты = Новый Соответствие;
    // пара ключ (произвольного типа) - значение (произвольного типа)
    СобытияДаты.Вставить(1980, "Олимпиада в Москве");
    СобытияДаты.Вставить(1961, "Первый полет человека в космос.");
 
    // =========================== операции с соответствиями ===========================
	
	// получить значение соответствия по ключу 
    Сообщить(СобытияДаты.Получить(1980)); // "Олимпиада в Москве"
 
    // узнать есть ли соответствие значения ключу 
    Если СобытияДаты.Получить(2014) = Неопределено Тогда
        Сообщить("В 2014 ничего не произошло.");
    КонецЕсли;
 
    // изменить значение ключа созданного соответствия 
    СобытияДаты.Вставить(1961, "Первый полет Гагарина в космос.");
 
    // узнать количество элементов соответствия
    Сообщить(СобытияДаты.Количество());
 
    // обойти все элементы соответствия
    Для Каждого Элемент Из СобытияДаты Цикл
        Сообщить(Строка(Элемент.Ключ) + " " + Элемент.Значение);
    КонецЦикла;
 
    // удалить элемент соответствия
    СобытияДаты.Удалить(1980);
 
    // очистить все элементы соответствия
    СобытияДаты.Очистить();
 
КонецПроцедуры