Процедура ПриНачалеРаботыСистемы()

	// Соединение строк
	Сообщить("Первого космонавта звали " + "Юрий" + " " + "Гагарин");
	Сообщить("Первый искусственный спутник Земли был запущен "+ '1957.10.04.22.28.34');    		
	Сообщить("В солнечной системе " + 8 + " планет");  

	// Операции над числами
	Сообщить (2 + 2);
	Сообщить (9 / 3);
	Сообщить (100 - 50);
	Сообщить (3 * 3);

	// Сложные арифметические выражения 
	Сообщить ((2 + 2) * (9 / 3) + (10 - 5) * 2);
	
	// Сообщить добавление секунд к дате
	Сообщить ('20250101' + 1);

	// Добавление дня к дате
	Сообщить ('20250101' + 24 * 60 * 60);
КонецПроцедуры