Процедура ПриНачалеРаботыСистемы()

	Сообщить("1 " + Формат(250.99, "ЧРД=="));
	Сообщить("2 " + Формат(5000, "ЧГ=0"));
	Сообщить("3 " + Формат(256193, "ЧРГ=*"));
	Сообщить("4 " + Формат(3, "ЧЦ=2; ЧВН="));
	Сообщить("5 " + Формат(0, "ЧН=ноль"));
	Сообщить("6 " + Формат(1, "ЧЦ=4; ЧВН=; ЧРГ=."));
	Сообщить("7 " + Формат(10.567, "ЧДЦ=2"));
	Сообщить("8 " + ЧислоПрописью(9999));
	Сообщить("9 " + ЧислоПрописью(25.99,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	Сообщить("10 " + ПредставлениеПериода(НачалоКвартала('20140101'), КонецКвартала('20140101'), "ФП=Истина"));
	Сообщить("11 " + Формат('20140101', "ДЛФ=ДД"));
	Сообщить("12 " + Формат('20140101', "ДФ=дддд"));
	Сообщить("13 " + Формат('20140101', "ДФ=ддд"));
	Сообщить("14 " + Формат('20140101', "ДФ=ММММ"));
	Сообщить("15 " + Формат('20140101', "ДФ=МММ"));
	Сообщить("16 " + Формат('20140101', "ДЛФ=Д"));
		
КонецПроцедуры
