// Наименьшее из пяти чисел

Функция НаименьшееИзПятиЧисел(МассивЧисел)
	
	НаименьшееЧисло = МассивЧисел[0];
	Для ЭлемМассива = 1 По 4 Цикл
		Если МассивЧисел[ЭлемМассива] < НаименьшееЧисло Тогда
			НаименьшееЧисло = МассивЧисел[ЭлемМассива];
		КонецЕсли;
	КонецЦикла;   

	Возврат НаименьшееЧисло;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	
	МассивЧисел = Новый Массив(5); 
	Для ЭлемМассива = 0 По 4 Цикл
		ВвестиЧисло(МассивЧисел[ЭлемМассива]);
	КонецЦикла;

	Результат = НаименьшееИзПятиЧисел(МассивЧисел);
	ОткрытьЗначение("Наименьшее из введенных чисел равно " + Результат);
	
КонецПроцедуры
