Процедура ПриНачалеРаботыСистемы()
	Люди = Новый Массив(3);

	Для СтрМассива = 0 По 2 Цикл
		Люди[СтрМассива] = Новый Структура("Имя, Возраст");
		ВвестиСтроку(Люди[СтрМассива].Имя);
		ВвестиСтроку(Люди[СтрМассива].Возврат);
	КонецЦикла;

	ИмяСамогоСтаршегоЧеловека = Люди[0].Имя;
	НаибольшийВозраст = Люди[0].Возврат;

	Для СтрМассива = 1 По 2 Цикл
		Если Люди[СтрМассива].Возраст > НаибольшийВозраст Тогда
			ИмяСамогоСтаршегоЧеловека = Люди[СтрМассива].Имя;
			НаибольшийВозраст = Люди[СтрМассива].Возврат;
		КонецЕсли;
	КонецЦикла;

	ОткрытьЗначение(
		"Самый старший человек - " + ИмяСамогоСтаршегоЧеловека +
		". Ему " + НаибольшийВозраст + " лет."
	);
КонецПроцедуры
