// Наибольшее из пяти чисел

Функция НаибольшееИзПятиЧисел(МассивЧисел)
	
	НаибольшееЧисло = МассивЧисел[0];
	Для ЭлемМассива = 1 По 4 Цикл
		Если МассивЧисел[ЭлемМассива] > НаибольшееЧисло Тогда
			НаибольшееЧисло = МассивЧисел[ЭлемМассива];
		КонецЕсли;
	КонецЦикла;  

	Возврат НаибольшееЧисло;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	
	МассивЧисел = Новый Массив(5); 
	Для ЭлемМассива = 0 По 4 Цикл
		ВвестиЧисло(МассивЧисел[ЭлемМассива]);
	КонецЦикла;

	Результат = НаибольшееИзПятиЧисел(МассивЧисел);
	ОткрытьЗначение("Наименьшее из введенных чисел равно " + Результат);
	
КонецПроцедуры
