ЗапросЗначенияПервойИПоследнейЦеныИДатыИхУстановкиВременныеТаблицы = 
	"
	|ВЫБРАТЬ
	|	ЦеныСрезПервых.Клиент,
	|	ЦеныСрезПервых.Еда,
	|	ЦеныСрезПервых.Цена,
	|	ЦеныСрезПервых.Регистратор.Дата КАК ДатаУстановки
	|ПОМЕСТИТЬ
	|	ВТЦеныСрезПервых
	|ИЗ
	|	РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПервых()КАК ЦеныСрезПервых
	|
	|;
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Клиент,
	|	ЦеныСрезПоследних.Еда,
	|	ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Регистратор.Дата КАК ДатаУстановки
	|ПОМЕСТИТЬ
	|	ВТЦеныСрезПоследних
	|ИЗ
	|	РегистрСведений.ЦенаНаЕдуДляКлиентов.СрезПоследних() КАК ЦеныСрезПоследних
	|
	|;
	|
	|ВЫБРАТЬ
	|	ВТЦеныСрезПервых.Клиент,
	|	ВТЦеныСрезПервых.Еда,
	|	ВТЦеныСрезПервых.Цена КАК ПерваяЦена,
	|	ВТЦеныСрезПервых.ДатаУстановки КАК ДатаУстановкиПервойЦены,
	|	ВТЦеныСрезПоследних.Цена КАК ПоследняяЦена,
	|	ВТЦеныСрезПоследних.ДатаУстановки КАК ДатаУстановкиПоследнейЦены
	|ИЗ
	|	ВТЦеныСрезПервых
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТЦеныСрезПоследних
	|ПО
	|	ВТЦеныСрезПервых.Клиент = ВТЦеныСрезПоследних.Клиент И 
	|	ВТЦеныСрезПервых.Еда = ВТЦеныСрезПоследних.Еда
	|УПОРЯДОЧИТЬ ПО 
	|	ВТЦеныСрезПервых.Клиент.Наименование ВОЗР,
	|	ВТЦеныСрезПоследних.Еда.Наименование ВОЗР
	|ИТОГИ ПО
	|	ВТЦеныСрезПервых.Клиент
	|";

ЗапросЗначенияПервойИПоследнейЦеныИДатыИхУстановки = 
	"
	|ВЫБРАТЬ
	|	ВТЦеныСрезПервых.Клиент,
	|	ВТЦеныСрезПервых.Еда,
	|	ВТЦеныСрезПервых.Цена КАК ПерваяЦена,
	|	ВТЦеныСрезПервых.ДатаУстановки КАК ДатаУстановкиПервойЦены,
	|	ВТЦеныСрезПоследних.Цена КАК ПоследняяЦена,
	|	ВТЦеныСрезПоследних.ДатаУстановки КАК ДатаУстановкиПоследнейЦены
	|ИЗ
	|	ВТЦеныСрезПервых
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТЦеныСрезПоследних
	|ПО
	|	ВТЦеныСрезПервых.Клиент = ВТЦеныСрезПоследних.Клиент И 
	|	ВТЦеныСрезПервых.Еда = ВТЦеныСрезПоследних.Еда
	|УПОРЯДОЧИТЬ ПО 
	|	ВТЦеныСрезПервых.Клиент.Наименование ВОЗР,
	|	ВТЦеныСрезПоследних.Еда.Наименование ВОЗР
	|ИТОГИ ПО
	|	ВТЦеныСрезПервых.Клиент
	|";