// Заказы каждого клиента, упорядоченные по дате

ЗапросЗаказыКлиентовУпорядоченныеПоДате.Текст = 
	"
	|ВЫБРАТЬ
	|	Клиент,
	|	Номер
	|	Дата
	|ИЗ
	|	Документ.ЗаказКлиента
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	Клиент
	|";

// -------------------------------------------

ЗапросКоличествоЗаказанныхПродуктовПоМесяцамПоУбыванию.Текст = 
	"
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Ссылка.Дата, МЕСЯЦ) КАК Период,
	|	Еда,
	|	Количество
	|ИЗ
	|	Документ.ЗаказКлиента.Продукты
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР,
	|	Количество УБЫВ
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Период
	|";

