ЗапросГруппировкаЗаказовПоДнямНедели.Текст = 
	"
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 1 ТОГДА
	|			""Понедельник""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 2 ТОГДА
	|			""Вторник""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 3 ТОГДА
	|			""СРЕДА""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 4 ТОГДА
	|			""Четверг""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 5 ТОГДА
	|			""Пятница"" 
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 6 ТОГДА
	|			""Суббота""
	|		КОГДА ДЕНЬНЕДЕЛИ(Дата) = 7 ТОГДА
	|			""Воскресенье""
	|	КОНЕЦ КАК День,
	|	Ссылка КАК Заказ
	|ИЗ
	|	Документ.ЗаказКлиента
	|УПОРЯДОЧИТЬ ПО
	|	ДЕНЬНЕДЕЛИ(Дата)
	|ИТОГИ ПО
	|	День
	|";