Процедура ПредпочтенияЧерезСтруктуру()
	ПредпочтенияЧеловека = Новый Структура("Цвет, Фильм, ВремяГода");
	ВвестиСтроку(ПредпочтенияЧеловека.Цвет, "Ваш любимый цвет?");
	ВвестиСтроку(ПредпочтенияЧеловека.Фильм, "Ваш любимый фильм?");
	ВвестиСтроку(ПредпочтенияЧеловека.ВремяГода, "Ваше любимое время года?");
	
	Сообщить("Цвет: " + ПредпочтенияЧеловека.Цвет + ", фильм: " + ПредпочтенияЧеловека.Фильм + ", время года: " + ПредпочтенияЧеловека.ВремяГода);
КонецПроцедуры

Процедура ПредпочтенияЧерезМассив()
	ПредпочтенияЧеловека = Новый Массив(3);
	ВвестиСтроку(ПредпочтенияЧеловека[0], "Ваш любимый цвет?");
	ВвестиСтроку(ПредпочтенияЧеловека[1], "Ваш любимый фильм?");
	ВвестиСтроку(ПредпочтенияЧеловека[2], "Ваше любимое время года?");
	
	Сообщить("Цвет: " + ПредпочтенияЧеловека[0] + ", фильм: " + ПредпочтенияЧеловека[1] + ", время года: " + ПредпочтенияЧеловека[2]);
КонецПроцедуры

Процедура ПредпочтенияЧерезСписокЗначений()
	ПредпочтенияЧеловека = Новый СписокЗначений;
	ПредпочтенияЧеловека.Добавить("");
	ПредпочтенияЧеловека.Добавить("");
	ПредпочтенияЧеловека.Добавить("");
	
	ВвестиСтроку(ПредпочтенияЧеловека[0].Значение, "Ваш любимый цвет?");
	ВвестиСтроку(ПредпочтенияЧеловека[1].Значение, "Ваш любимый фильм?");
	ВвестиСтроку(ПредпочтенияЧеловека[2].Значение, "Ваше любимое время года?");

	Сообщить("Цвет: " + ПредпочтенияЧеловека[0] + ", фильм: " + ПредпочтенияЧеловека[1] + ", время года: " + ПредпочтенияЧеловека[2]);
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()

	ПредпочтенияЧерезСтруктуру();
	ПредпочтенияЧерезМассив();
	ПредпочтенияЧерезСписокЗначений();

КонецПроцедуры