Процедура ПриНачалеРаботыСистемы()       
	
	Строка1 = "Сервер";
    Строка2 = "Толстый клиент";       
	Строка3 = "ТОНКИЙ КЛИЕНТ";   
	Строка4 = "Веб-клиент";  
	Строка5 = "ВнЕшНеЕ СоЕдИнЕнИе";  
	Строка6 = "Мобильный автономный сервер";
	Строка7 = "Мобильный КЛИЕНТ";  
	Строка8 = "МОБИЛЬНОЕ приложение";
                                                       
	Сообщить("Исходная строка: " + Строка1 + ". Строка в нижнем регистре: " + ВРег(Строка1));                                                            
    Сообщить("Исходная строка: " + Строка2 + ". Строка в нижнем регистре: " + ВРег(Строка2));
	Сообщить("Исходная строка: " + Строка3 + ". Строка в нижнем регистре: " + ВРег(Строка3));
	Сообщить("Исходная строка: " + Строка4 + ". Строка в нижнем регистре: " + ВРег(Строка4));
	Сообщить("Исходная строка: " + Строка5 + ". Строка в нижнем регистре: " + ВРег(Строка5));
	Сообщить("Исходная строка: " + Строка6 + ". Строка в нижнем регистре: " + ВРег(Строка6));
	Сообщить("Исходная строка: " + Строка7 + ". Строка в нижнем регистре: " + ВРег(Строка7));
	Сообщить("Исходная строка: " + Строка8 + ". Строка в нижнем регистре: " + ВРег(Строка8));

КонецПроцедуры
