Функция КоличествоСловВСтроке(Строка) 
    КоличествоСлов = 0;

    ВСлове = Ложь;

    Для Инд = 1 По СтрДлина(Строка) Цикл
        // Проверяем, является ли символ пробельным     
		Символ = Сред(Строка, Инд, 1);
        Если Символ = " " Или Символ = Символы.Таб Или Символ = Символы.ПС Или Символ = Символы.ВК Тогда
            Если ВСлове Тогда
                ВСлове = Ложь;
                КоличествоСлов = КоличествоСлов + 1;
            КонецЕсли;
        Иначе
            ВСлове = Истина;
        КонецЕсли;
    КонецЦикла;

    // Завершающее слово
    Если ВСлове Тогда
        КоличествоСлов = КоличествоСлов + 1;
    КонецЕсли;

    Возврат КоличествоСлов;
КонецФункции

Процедура ПриНачалеРаботыСистемы()  
    // Примеры строк
    Сообщить(КоличествоСловВСтроке(""));
    Сообщить(КоличествоСловВСтроке("   "));
    Сообщить(КоличествоСловВСтроке("   Функция       СтрДлина     "));
    Сообщить(КоличествоСловВСтроке("Возвращает количество символов в строке"));
КонецПроцедуры

