// Вычисление факториала
// Автор: Гордеев Никита, 2024

Функция Факториал(Знач Число) 
    // Инициализируем факториал
    ФакториалЧисла = 1;

    // Цикл от 1 до Число для вычисления факториала
    Для Сч = 1 По Число Цикл
        ФакториалЧисла = ФакториалЧисла * Сч;
    КонецЦикла;

    // Возвращаем результат
    Возврат ФакториалЧисла;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
    Число1 = 1;
	Число2 = 2;
	Число3 = 3;
	Число4 = 4;
	Число5 = 5;
	Число6 = 6;
	Число7 = 7;
	Число8 = 8;
	Число9 = 9;
	Число10 = 10;
	
    // Вычисление факториала
    Сообщить("Факториал числа " + Строка(Число1) + " равен " + Строка(Факториал(Число1))); // 1
	Сообщить("Факториал числа " + Строка(Число2) + " равен " + Строка(Факториал(Число2))); // 2
	Сообщить("Факториал числа " + Строка(Число3) + " равен " + Строка(Факториал(Число3))); // 6
	Сообщить("Факториал числа " + Строка(Число4) + " равен " + Строка(Факториал(Число4))); // 24
	Сообщить("Факториал числа " + Строка(Число5) + " равен " + Строка(Факториал(Число5))); // 120
	Сообщить("Факториал числа " + Строка(Число6) + " равен " + Строка(Факториал(Число6))); // 720
	Сообщить("Факториал числа " + Строка(Число7) + " равен " + Строка(Факториал(Число7))); // 5040
	Сообщить("Факториал числа " + Строка(Число8) + " равен " + Строка(Факториал(Число8))); // 40320
	Сообщить("Факториал числа " + Строка(Число9) + " равен " + Строка(Факториал(Число9))); // 362880
	Сообщить("Факториал числа " + Строка(Число10) + " равен " + Строка(Факториал(Число10))); // 3628800

КонецПроцедуры
