Процедура ПриНачалеРаботыСистемы()

	ПервоеЧислоОтПользователя = 0;
	ВвестиЧисло(ПервоеЧислоОтПользователя);

	ВтороеЧислоОтПользователя = 0;
	ВвестиЧисло(ВтороеЧислоОтПользователя);

	Если ПервоеЧислоОтПользователя > ВтороеЧислоОтПользователя Тогда
		ОткрытьЗначение("Первое число больше второго");
	ИначеЕсли (ПервоеЧислоОтПользователя = ВтороеЧислоОтПользователя) Тогда
		ОткрытьЗначение("Первое число равно второму");
	Иначе 
		ОткрытьЗначение("Второе число больше первого");
	КонецЕсли;

КонецПроцедуры
