Процедура МаксимальныйМинимальныйЭлементыИСумма(Числа)
	
	МинимальныйЭлемент = Числа[0];
	МаксимальныйЭлемент = Числа[0]; 
	СуммаЭлементов = 0;
	
	Для Индекс = 1 По 99 Цикл
		ТекущийЭлемент = Числа[Индекс];
		Если ТекущийЭлемент < МинимальныйЭлемент Тогда 
			МинимальныйЭлемент = Числа[Индекс];
		КонецЕсли; 
		
		Если ТекущийЭлемент > МаксимальныйЭлемент Тогда
			МаксимальныйЭлемент = Числа[Индекс];
		КонецЕсли;
		
		СуммаЭлементов = СуммаЭлементов + ТекущийЭлемент;
	КонецЦикла;   
	
	СреднееАрифметическое = СуммаЭлементов / 100;
	
	Сообщить("Максимальный: " + МаксимальныйЭлемент);
	Сообщить("Минимальный: " + МинимальныйЭлемент);
	Сообщить("Сумма: " + СуммаЭлементов);
	Сообщить("Среднее арифметическое: " + СреднееАрифметическое);
	
КонецПроцедуры      

Процедура ОтсортироватьМассивПузырьковойСортировкой(Числа) 
	
	Пока Истина Цикл
		
		БылиЛиПерестановки = Ложь;
		
		Для Индекс = 1 По 99 Цикл  
			Если Числа[Индекс-1] > Числа[Индекс] Тогда  
				Буфер = Числа[Индекс-1];
				Числа[Индекс-1] = Числа[Индекс];
				Числа[Индекс] = Буфер; 
				БылиЛиПерестановки = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если БылиЛиПерестановки = Ложь Тогда
			Прервать;    
		КонецЕсли;  
		
	КонецЦикла;     
	
	Строка = "";
	Для Каждого Элемент из Числа Цикл 
		Строка = Строка + Элемент + " ";
	КонецЦикла;      
	Сообщить(Строка);
	
КонецПроцедуры 

Процедура ВычислитьФакториалЧисла(Число) 
	Факториал = 1;
	
	Для Переменная = 1 По Число Цикл
		Факториал = Факториал * Переменная;
	КонецЦикла;
	
	Сообщить(Факториал); 
	
КонецПроцедуры
		
Процедура ПриНачалеРаботыСистемы() 
	Числа = Новый Массив(100);
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Для Индекс = 0 По 99 Цикл  
		Числа[Индекс] = ГСЧ.СлучайноеЧисло(0, 1000);
	КонецЦикла;
	
	МаксимальныйМинимальныйЭлементыИСумма(Числа);
	ОтсортироватьМассивПузырьковойСортировкой(Числа);
	ВычислитьФакториалЧисла(ГСЧ.СлучайноеЧисло(1, 15));
	
КонецПроцедуры