// Нахождение всех делителей числа
// Автор: Гордеев Никита, 2024

Процедура НайтиДелители(Число)
    // Переменная для делителя
    Сч = 1;

    // Ищем делители до квадратного корня из числа
    Пока Сч * Сч <= Число Цикл
        // Проверяем, делится ли число на Сч
        Если Число % Сч = 0 Тогда
            Сообщить(Строка(Сч)); // Выводим делитель Сч
            Если Сч * Сч <> Число Тогда
                Сообщить(Строка(Число / Сч)); // Выводим второй делитель, если это не квадрат числа
            КонецЕсли;
        КонецЕсли;
        Сч = Сч + 1; // Переходим к следующему числу
    КонецЦикла;
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
    // Ввод числа
    Число = 10; // Можно заменить на ВводЧисла() для запроса пользователя
    НайтиДелители(Число); 
КонецПроцедуры


// 1 -> 1 = 1
// 2 -> 1, 2 = 2
// 4 -> 1, 2, 4 = 3
// 5 -> 1, 2 = 2
// 10 -> 1, 2, 5, 10 = 4
// 20 -> 1, 2, 4, 5, 10, 10 = 6