// Наименьшее общее кратное двух чисел
// Автор: Гордеев Никита, 2024

Функция МодульЧисла(Число)
	Если Число > 0 Тогда
		МодульЧисла = Число;
	Иначе
		МодульЧисла = - Число;
	КонецЕсли;
	
	Возврат МодульЧисла;
КонецФункции

Функция НОД(Знач a, Знач b)
	// Поиск НОД с использованием алгоритма Евклида
	Пока b <> 0 Цикл
		Остаток = a % b;
		a = b;
		b = Остаток;
	КонецЦикла;   
	
	Возврат a;
КонецФункции

Функция НОК(Знач a, Знач b) 
	// Найдём НОК через НОД
	Возврат МодульЧисла(a * b) / НОД(a,b);
КонецФункции

Процедура ПриНачалеРаботыСистемы()
	// Ввод значений
	a = 2;
	b = 3;
	
	// Вычисление НОК
	lcm = НОК(a, b);
	Сообщить("НОК чисел " + Строка(a) + " и " + Строка(b) + ": " + Строка(lcm));
КонецПроцедуры


