// Алгоритм сортировки пузырьком
// Временная сложность O(n^2)
// Автор: Гордеев Никита, 2024

Функция ОтсортироватьМассив(ИсходныйМассив)
    Если ТипЗнч(ИсходныйМассив) <> Тип("Массив") Тогда
        Сообщить("Ошибка: На вход должен подаваться массив.");
        Возврат Неопределено;
    КонецЕсли;

    Для i = 0 По ИсходныйМассив.Количество() - 2 Цикл
        Для j = 0 По ИсходныйМассив.Количество() - i - 2 Цикл
            Если ИсходныйМассив[j] > ИсходныйМассив[j + 1] Тогда
                // Обмен элементов
                ЭлементМассива = ИсходныйМассив[j];
                ИсходныйМассив[j] = ИсходныйМассив[j + 1];
                ИсходныйМассив[j + 1] = ЭлементМассива;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

    Возврат ИсходныйМассив;
КонецФункции

Процедура ПриНачалеРаботыСистемы()
    МассивЧисел = Новый Массив;
    МассивЧисел.Добавить(10);
    МассивЧисел.Добавить(3);
    МассивЧисел.Добавить(7);
    МассивЧисел.Добавить(1);

    СтрокаМассива = "";
    Для Каждого ЭлементМассива Из МассивЧисел Цикл
        СтрокаМассива = СтрокаМассива + Число(ЭлементМассива) + " ";
    КонецЦикла;

    Сообщить("Исходный массив: " + СтрокаМассива);

    Отсортированный = ОтсортироватьМассив(МассивЧисел);

    Если Отсортированный <> Неопределено Тогда
        СтрокаОтсортированного = "";
        Для Каждого ЭлементМассива Из Отсортированный Цикл
            СтрокаОтсортированного = СтрокаОтсортированного + Число(ЭлементМассива) + " ";
        КонецЦикла;

        Сообщить("Отсортированный массив: " + СтрокаОтсортированного);
    КонецЕсли;   
КонецПроцедуры
